package.org
#+startup: indent
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       BAD14AD7-016D-4E24-AEFD-097C46F62E2F
:END:
#+title: 我使用的 Emacs 第三方包/插件与相关配置
#+date: 2023-02-08T23:06:43+0800
#+auto_tangle: t

sibling file: [[file:README.org][Emacs config]]

* File Header
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       3FBD2109-C9EB-4FC6-A137-E5F21AC8E20D
:END:

#+begin_src emacs-lisp
;; -*- coding: utf-8; lexical-binding: t; -*-
;;; my-package.el

;; DATE 2023-02-09T02:38:27+0800
#+end_src

* emacs-everywhere
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle no
:ID:       76AD93CA-493F-4E43-A320-E8B9B52DC86E
:END:

#+begin_src emacs-lisp :tangle no
(use-package emacs-everywhere
  :ensure nil
  :defer 110
  :after org
  :config
  ;;2022-10-17 "Reddit" is causing an error?;  (setq emacs-everywhere-markdown-windows ("Reddit" "Stack Exchange" "Stack Overflow" "Discord" "Element" "Slack" "HedgeDoc" "HackMD" "Zulip" "Pull Request" "Issue" "Comparing .*\\.\\.\\."))
  (setq emacs-everywhere-frame-name-format
        "Emacs Everywhere • C-c C-c • %s — %s")
  (setq emacs-everywhere-frame-parameters
        `((name . "emacs-everywhere")
          (width . 100)
          (height . 30)
          )))
#+end_src

* Benchmark/Debug/Discover/Monitor Emacs
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle no
:ID:       D28281D0-F365-46D2-BF08-E76AFC6D0F20
:END:
** bug-hunter

[[https://github.com/Malabarba/elisp-bug-hunter/][Malabarba/elisp-bug-hunter: Hunt down errors in elisp files.]]

#+begin_src emacs-lisp :tangle no

#+end_src

** explain-pause-mode

[[https://github.com/lastquestion/explain-pause-mode][lastquestion/explain-pause-mode: top, but for Emacs.]]

#+begin_src emacs-lisp
(use-package explain-pause-mode
  :ensure nil
  :defer 2
  :config
  (setq explain-pause-top-auto-refresh-interval 0.1)
  )

;; (run-with-idle-timer
;;  1 nil
;;  #'(lambda ()
;;      (require 'explain-pause-mode)
;;      ))
#+end_src

** benchmark-init                                                    :FIXME:

#+begin_src emacs-lisp
(use-package benchmark-init
  :ensure nil
  :init (benchmark-init/activate)
  ;; To disable collection of benchmark data after init is done.
  :hook (after-init . benchmark-init/deactivate)
  ;; (add-hook 'after-init-hook 'benchmark-init/deactivate)
  )

;; (add-hook 'after-init-hook
;;           (lambda () (message "loaded in %s" (emacs-init-time))))
#+end_src

#+begin_src emacs-lisp :tangle no
;; profile: benchmark-init
;; {{{
;; (require 'benchmark-init-modes)  ; FIXME
;; (require 'benchmark-init)
;; (benchmark-init/activate)
;; ;; To disable collection of benchmark data after init is done.
;; (add-hook 'after-init-hook 'benchmark-init/deactivate)
;; }}}
#+end_src

** esup

#+begin_src emacs-lisp
(use-package esup
  :ensure nil
  :pin melpa ; To use MELPA Stable use ":pin melpa-stable"
  )
#+end_src

** mode-minder :Git:

#+begin_src emacs-lisp
(use-package mode-minder
  :ensure nil
  :defer 3
  )
#+end_src

** elisp-demos

#+begin_src emacs-lisp
(use-package elisp-demos
  :ensure nil
  :after helpful
  :bind
  (
   :map help-mode-map
   ("C-c M-d" . elisp-demos-add-demo)
   )
  ;; :config
  :init
  (advice-add
   'describe-function-1
   :after #'elisp-demos-advice-describe-function-1)
  (advice-add 'helpful-update :after #'elisp-demos-advice-helpful-update)
  )
#+end_src

* Emacs Package Database epkg+epkgs
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       1898178B-9C71-436F-9593-8F16548E5522
:END:

#+begin_src emacs-lisp
(use-package epkg
  :ensure nil
  :defer t
  ;; :custom (epkg-database-connector 'sqlite-builtin)
  :config
  (setq epkg-repository "~/Documents/GitHub/epkgs")
  (setq package-list-unversioned t) ;; unversioned packages(ibuffer and so on)
  ;; 怎样快速找到 elpa 目录下那些重复的包 - Emacs China
  ;; https://emacs-china.org/t/topic/4244
  (defun my/list-packages-and-versions ()
    "Returns a list of all installed packages and their versions"
    (interactive)
    (mapcar
     (lambda (pkg)
       `(,pkg ,(package-desc-version
                (cadr (assq pkg package-alist)))))
     package-activated-list))
  )

(use-package epkgs
  :ensure nil
  :defer t
  )
#+end_src

* 通知帮助与文档
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       3C4FF7DB-9E02-43B9-8E27-F8504FDC1EE6
:END:
** notify

[[https://github.com/netjune/my_elisp/blob/master/misc/notify.el][netjune/my_elisp/misc/notify.el]]

** helpful

#+begin_src emacs-lisp
;; helpful
;; {{{
(use-package helpful
  :ensure nil
  :bind
  ;; ("C-h C" . helpful-command) ;; Look up *C*ommands.
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  ;; ("C-h F" . helpful-function) ; functions only
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  ("C-h h" . #'helpful-at-point) ; Lookup the current symbol at point.
  ([remap describe-command] . helpful-command) ; C-h x
  ([remap describe-function] . helpful-callable)    ; both functions and macros
  ([remap describe-key] . helpful-key) ; C-h k
  ([remap describe-symbol] . helpful-symbol) ; C-h o
  ([remap describe-variable] . helpful-variable) ; C-h v
  ;; :config
  ;; helpful + ivy
  ;; (setq counsel-describe-function-function #'helpful-callable)
  ;; (setq counsel-describe-variable-function #'helpful-variable)
  )
;; }}}
#+end_src

** RFC

#+begin_src emacs-lisp
;; RFC
;; {{{
(use-package rfc-mode
  :ensure nil
  :defer t
  :config
  (setq rfc-mode-directory (expand-file-name "~/Documents/GitHub/RFC-all/txt/"))
  (setq rfc-mode-index-path (concat rfc-mode-directory "rfc-index.txt"))
  )
;; }}}
#+end_src

* macOS :macOS:
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       7598153B-E306-41AC-8BF5-98CD3F73ABBE
:END:

** osx-dictionary

#+begin_src emacs-lisp
;; dictionary: Apple 词典: osx-dictionary
;; {{{
(use-package osx-dictionary
  :ensure nil
  :defer t
  :bind
  ("C-c d f" . osx-dictionary-search-word-at-point) ; DeFine word
  )
;; }}}
#+end_src

** org-mac-link :macOS:Git:

#+begin_src emacs-lisp
;; org-mac-link
;; {{{
(use-package org-mac-link
  :ensure nil
  :bind
  ("H-i H-i" . org-mac-link-get-link)
  )
;; }}}
#+end_src

* 环境变量
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       18EB739C-4A18-4495-BC88-3757F4B2CBD3
:END:

[[https://emacs-china.org/t/topic/5507][Mac 下给 Emacs 设置 PATH 和 exec-path - Emacs China]]

=~/.profile= : [[https://emacs-china.org/t/emacs-mac-port-profile/2895/30][Emacs Mac Port 能自动从 ~/.profile 继承环境变量 - Emacs China]]

#+begin_src emacs-lisp
;; exec-path-from-shell
;; {{{
;; https://emacs-china.org/t/exec-path-from-shell/2515/10
(use-package exec-path-from-shell
  :defer 1
  ;; :if (memq window-system '(mac ns x))
  ;; :when (or (memq window-system '(mac ns x))
  ;;           (unless (memq system-type '(windows-nt dos))
  ;;             (daemonp)))
  :init
  ;; 设成 nil 则不从 .zshrc 读取，只从 .zshenv 读取可以加快速度
  ;; 但需要将环境变量都放到 .zshenv 中，而非 .zshrc 中
  (setq exec-path-from-shell-check-startup-files nil)
  (setq exec-path-from-shell-arguments '("-l" )) ;remove -i read form .zshenv
  (setq exec-path-from-shell-variables '("PATH"))
  :config
  ;; (setq exec-path-from-shell-variables
  ;;       '(
  ;;         "PATH"
  ;;         "MANPATH"
  ;;         "GOROOT"
  ;;         "GOPATH"
  ;;         "EDITOR"
  ;;         "PYTHONPATH"
  ;;         ))

  (progn
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize))

    (when (daemonp)
      (exec-path-from-shell-initialize)
      )
    )
  )
;; (exec-path-from-shell-initialize)
;; }}}
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://emacs-china.org/t/emacs-q-emacs/18380/28
;; Load env
(defconst my-env-file (concat user-emacs-directory "env"))
(when (and (or (display-graphic-p)
               (daemonp))
           (file-exists-p my-env-file))
  (defun my-load-envvars-file (file &optional noerror)
    "Read and set envvars from FILE.
If NOERROR is non-nil, don't throw an error if the file doesn't exist or is
unreadable. Returns the names of envvars that were changed."
    (if (not (file-readable-p file))
        (unless noerror
          (signal 'file-error (list "Couldn't read envvar file" file)))
      (let (envvars environment)
        (with-temp-buffer
          (save-excursion
            (insert "\n")
            (insert-file-contents file))
          (while (re-search-forward "\n *\\([^#= \n]*\\)=" nil t)
            (push (match-string 1) envvars)
            (push (buffer-substring
                   (match-beginning 1)
                   (1- (or (save-excursion
                             (when (re-search-forward "^\\([^= ]+\\)=" nil t)
                               (line-beginning-position)))
                           (point-max))))
                  environment)))
        (when environment
          (setq process-environment
                (append (nreverse environment) process-environment)
                exec-path
                (if (member "PATH" envvars)
                    (append (split-string (getenv "PATH") path-separator t)
                            (list exec-directory))
                  exec-path)
                shell-file-name
                (if (member "SHELL" envvars)
                    (or (getenv "SHELL") shell-file-name)
                  shell-file-name))
          envvars))))

  (my-load-envvars-file my-env-file))
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://emacs-china.org/t/exec-path-from-shell/2515/14

(defun exec-path-from-shell-setenv (name value)
  "Set the value of environment var NAME to VALUE.
Additionally, if NAME is \"PATH\" then also set corresponding
variables such as `exec-path'."
  (setenv name value)
  (when (string-equal "PATH" name)
    (setq eshell-path-env value
          exec-path (append (parse-colon-path value) (list exec-directory)))))

;; 复用 exec-path-from-shell 内的一个方法，其实自己实现也可以
(defun exec-path-from-shell-setenv (name value)
  "Set the value of environment var NAME to VALUE.
Additionally, if NAME is \"PATH\" then also set corresponding
variables such as `exec-path'."
  (setenv name value)
  (when (string-equal "PATH" name)
    (setq eshell-path-env value
          exec-path (append (parse-colon-path value) (list exec-directory)))))
;;调用 exec-path-from-shell-setenv，手动传入参数，每次修改 PATH 都要重新修改一次。
(exec-path-from-shell-setenv
 "PATH"
 "/Users/n/.cask/bin:/opt/theos/bin:/Users/n/wsybin:/usr/local/opt/coreutils/libexec/gnubin:/usr/local/sbin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/X11/bin:/Applications/Server.app/Contents/ServerRoot/usr/bin:/Applications/Server.app/Contents/ServerRoot/usr/sbin:/usr/local/git/bin:/Users/n/.rvm/bin"
 )
#+end_src

#+begin_src emacs-lisp :tangle no
;; {{{
(require 'exec-path-from-shell)

(setq exec-path-from-shell-check-startup-files nil)

(defvar cache-path-from-shell-loaded-p nil)

(defadvice exec-path-from-shell-initialize (around cache-path-from-shell-advice activate)
  (if cache-path-from-shell-loaded-p
      (message "All shell environment variables has loaded in Emacs, yow!")
    (setq cache-path-from-shell-loaded-p t)
    ad-do-it
    ))

(provide 'cache-path-from-shell)
;; }}}

(require 'cache-path-from-shell)
#+end_src

* 系统/软件交互           :输入法:
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       298DCAED-8681-41C7-B229-38CD63B8DE5A
:END:
