site-lisp/my-package.el
;; [[file:../package.org::*File Header][File Header:1]]
;; -*- coding: utf-8; lexical-binding: t; -*-
;;; my-package.el

;; DATE 2023-02-09T02:38:27+0800
;; File Header:1 ends here

;; [[file:../package.org::*Emacs Package Database epkg+epkgs][Emacs Package Database epkg+epkgs:1]]
(use-package epkg
  :ensure nil
  :defer t
  ;; :custom (epkg-database-connector 'sqlite-builtin)
  :config
  (setq epkg-repository "~/Documents/GitHub/epkgs")
  (setq package-list-unversioned t) ;; unversioned packages(ibuffer and so on)
  ;; 怎样快速找到 elpa 目录下那些重复的包 - Emacs China
  ;; https://emacs-china.org/t/topic/4244
  (defun my/list-packages-and-versions ()
    "Returns a list of all installed packages and their versions"
    (interactive)
    (mapcar
     (lambda (pkg)
       `(,pkg ,(package-desc-version
                (cadr (assq pkg package-alist)))))
     package-activated-list))
  )

(use-package epkgs
  :ensure nil
  :defer t
  )
;; Emacs Package Database epkg+epkgs:1 ends here

;; [[file:../package.org::*helpful][helpful:1]]
;; helpful
;; {{{
(use-package helpful
  :ensure nil
  :bind
  ;; ("C-h C" . helpful-command) ;; Look up *C*ommands.
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  ;; ("C-h F" . helpful-function) ; functions only
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  ("C-h h" . #'helpful-at-point) ; Lookup the current symbol at point.
  ([remap describe-command] . helpful-command) ; C-h x
  ([remap describe-function] . helpful-callable)    ; both functions and macros
  ([remap describe-key] . helpful-key) ; C-h k
  ([remap describe-symbol] . helpful-symbol) ; C-h o
  ([remap describe-variable] . helpful-variable) ; C-h v
  ;; :config
  ;; helpful + ivy
  ;; (setq counsel-describe-function-function #'helpful-callable)
  ;; (setq counsel-describe-variable-function #'helpful-variable)
  )
;; }}}
;; helpful:1 ends here

;; [[file:../package.org::*RFC][RFC:1]]
;; RFC
;; {{{
(use-package rfc-mode
  :ensure nil
  :defer t
  :config
  (setq rfc-mode-directory (expand-file-name "~/Documents/GitHub/RFC-all/txt/"))
  (setq rfc-mode-index-path (concat rfc-mode-directory "rfc-index.txt"))
  )
;; }}}
;; RFC:1 ends here

;; [[file:../package.org::*osx-dictionary][osx-dictionary:1]]
;; dictionary: Apple 词典: osx-dictionary
;; {{{
(use-package osx-dictionary
  :ensure nil
  :defer t
  :bind
  ("C-c d f" . osx-dictionary-search-word-at-point) ; DeFine word
  )
;; }}}
;; osx-dictionary:1 ends here

;; [[file:../package.org::*org-mac-link][org-mac-link:1]]
;; org-mac-link
;; {{{
(use-package org-mac-link
  :ensure nil
  :bind
  ("H-i H-i" . org-mac-link-get-link)
  )
;; }}}
;; org-mac-link:1 ends here

;; [[file:../package.org::*环境变量][环境变量:1]]
;; exec-path-from-shell
;; {{{
;; https://emacs-china.org/t/exec-path-from-shell/2515/10
(use-package exec-path-from-shell
  :defer 1
  ;; :if (memq window-system '(mac ns x))
  ;; :when (or (memq window-system '(mac ns x))
  ;;           (unless (memq system-type '(windows-nt dos))
  ;;             (daemonp)))
  :init
  ;; 设成 nil 则不从 .zshrc 读取，只从 .zshenv 读取可以加快速度
  ;; 但需要将环境变量都放到 .zshenv 中，而非 .zshrc 中
  (setq exec-path-from-shell-check-startup-files nil)
  (setq exec-path-from-shell-arguments '("-l" )) ;remove -i read form .zshenv
  (setq exec-path-from-shell-variables '("PATH"))
  :config
  ;; (setq exec-path-from-shell-variables
  ;;       '(
  ;;         "PATH"
  ;;         "MANPATH"
  ;;         "GOROOT"
  ;;         "GOPATH"
  ;;         "EDITOR"
  ;;         "PYTHONPATH"
  ;;         ))

  (progn
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize))

    (when (daemonp)
      (exec-path-from-shell-initialize)
      )
    )
  )
;; (exec-path-from-shell-initialize)
;; }}}
;; 环境变量:1 ends here
