package.org
** browser-hist :Git:

#+begin_src emacs-lisp
(use-package browser-hist
  :ensure nil
  :defer t
  :after (sqlite)
  :bind
  ("H-s H-s" . browser-hist-search)
  :config
  (setq browser-hist-db-paths
        '(
          (chrome . "$HOME/Library/Application Support/Google/Chrome/Default/History")
          (brave . "$HOME/Library/Application Support/BraveSoftware/Brave-Browser/Default/History")
          (firefox . "$HOME/Library/Application Support/Firefox/Profiles/*.default-release/places.sqlite")
          (safari . "$HOME/Library/Safari/History.db")
          ))
  (setq browser-hist-default-browser 'safari) ; FIXME
  :commands
  (browser-hist-search)
  )
#+end_src

** 输入法切换

| 当前输入法 | 光标前两个单词中是否有中文 | 空格或制表符数量 | 是否切换 |
|------------+----------------------------+------------------+----------|
| 中文       | 是                         |                0 | 否       |
| 中文       | 是                         |                1 | 否       |
| 中文       | 是                         |                2 | 是       |
| 中文       | 否                         |                0 |          |
| 中文       | 否                         |                1 |          |
| 中文       | 否                         |                2 |          |
| 英文       | 是                         |                0 | 否       |
| 英文       | 是                         |                1 |          |
| 英文       | 是                         |                2 |          |
| 英文       | 否                         |                0 |          |
| 英文       | 否                         |                1 |          |
| 英文       | 否                         |                2 |          |

** sis

#+begin_src emacs-lisp :tangle no
;; smart-input-source
;; {{{
(use-package sis
  :bind
  ;; ("<f9>" . sis-log-mode) ; 开启日志
  :init
  ;; `C-s/r' 默认优先使用英文 必须在 sis-global-respect-mode 前配置
  (setq sis-respect-go-english-triggers
        (list 'isearch-forward 'isearch-backward) ; isearch-forward 时默认进入 en
        sis-respect-restore-triggers
        (list 'isearch-exit 'isearch-abort))
  :config
  (sis-ism-lazyman-config
   "com.apple.keylayout.ABC"
   "com.apple.inputmethod.SCIM.ITABC"
   'macism
   )
  (sis-global-cursor-color-mode t)
  (sis-global-respect-mode t)
  (sis-global-context-mode t)
  (sis-global-inline-mode t)   ; 中文状态下，中文后<spc>切换英文，结束后切回中文

  ;; 特殊定制
  (setq sis-default-cursor-color "blue" ;; 英文光标色
        sis-other-cursor-color "orange"  ;; 中文光标色 green
        ;; sis-inline-tighten-head-rule 'all ; 删除头部空格，默认 1，删除一个空格，1/0/'all
        sis-inline-tighten-tail-rule 'all ; 删除尾部空格，默认 1，删除一个空格，1/0/'all
        sis-inline-with-english t ; 默认是 t, 中文 context 下输入<spc>进入内联英文
        sis-inline-with-other t) ; 默认是 nil，而且 prog-mode 不建议开启, 英文 context 下输入<spc><spc>进行内联中文
  ;; 特殊 buffer 禁用 sis 前缀,使用 Emacs 原生快捷键  setqsis-prefix-override-buffer-disable-predicates
  (setq sis-prefix-override-buffer-disable-predicates
        (list 'minibufferp
              (lambda (buffer) ; magit revision magit 的 keymap 是基于 text property 的，优先级比 sis 更高。进入 magit 后，disable sis 的映射
                (sis--string-match-p "^magit-revision:" (buffer-name buffer)))
              (lambda (buffer) ; special buffer，所有*打头的 buffer，但是不包括*Scratch* *New, *About GNU 等 buffer
                (and (sis--string-match-p
                      "^\*" (buffer-name buffer))
                     (not (sis--string-match-p
                           "^\*About GNU Emacs" (buffer-name buffer))) ; *About GNU Emacs" 仍可使用 C-h/C-x/C-c 前缀
                     (not (sis--string-match-p
                           "^\*New" (buffer-name buffer)))
                     (not (sis--string-match-p
                           "^\*Scratch" (buffer-name buffer))))))) ; *Scratch*  仍可使用 C-h/C-x/C-c 前缀
  )
;; }}}
#+end_src

* Emacs Lisp
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       075EC11F-FDC4-424B-A200-5B6ADBA7B580
:END:

** 代码分析

elisp-depmap

#+begin_src emacs-lisp
(use-package elisp-depmap
  :ensure nil
  :init
  ;; read-symbol-positions-list is deleted from Emacs 29
  (defvar read-symbol-positions-list nil)
  :bind
  (
   ("C-c H-d" . elisp-depmap-graphviz-digraph)
   ("C-c H-g" . elisp-depmap-graphviz)
   ("C-c H-s" . elisp-depmap-makesummarytable)
   )
  :config
  (setq elisp-depmap-parse-hashtablesize 1024)
  (setq elisp-depmap-exec-file
        (expand-file-name "assets/elisp-dep-ana.dot" user-emacs-directory))
  )
#+end_src

** 辅助编辑

#+begin_src emacs-lisp :tangle no
(use-package lisp
  :hook
  (after-save . check-parens))

(use-package elisp-mode
  :bind
  (
   :map emacs-lisp-mode-map
   ("C-c C-d C-d" . describe-function)
   ("C-c C-d d" . describe-function)
   ("C-c C-k" . eval-buffer))
  )

(use-package highlight-defined
  :ensure t
  :custom
  (highlight-defined-face-use-itself t)
  :hook
  (help-mode . highlight-defined-mode)
  (emacs-lisp-mode . highlight-defined-mode))

(use-package highlight-quoted
  :ensure t
  :hook
  (emacs-lisp-mode . highlight-quoted-mode))

(use-package highlight-sexp
  :quelpa
  (highlight-sexp
   :repo "daimrod/highlight-sexp" :fetcher github :version original)
  :hook
  (clojure-mode . highlight-sexp-mode)
  (emacs-lisp-mode . highlight-sexp-mode)
  (lisp-mode . highlight-sexp-mode))

(use-package eros
  :ensure t
  :hook
  (emacs-lisp-mode . eros-mode))

(use-package suggest
  :ensure t
  :defer t)

(use-package ipretty
  :defer t
  :ensure t
  :config
  (ipretty-mode 1))

(use-package nameless
  :ensure t
  :hook
  (emacs-lisp-mode .  nameless-mode)
  :custom
  (nameless-global-aliases '())
  (nameless-private-prefix t))

(use-package erefactor
  :ensure t
  :defer t)

(use-package flycheck-package
  :ensure t
  :hook
  (emacs-lisp-mode . flycheck-package-setup))

(use-package elsa
  :defer t
  :ensure t)

(use-package flycheck-elsa
  :ensure t
  :hook
  (emacs-lisp-mode . flycheck-elsa-setup))
#+end_src

** 格式化 elisp-autofmt

#+begin_src emacs-lisp
(use-package elisp-autofmt
  :commands
  (elisp-autofmt-mode elisp-autofmt-buffer)
  :hook (emacs-lisp-mode . elisp-autofmt-mode)
  :config
  (setq elisp-autofmt-cache-directory
        (expand-file-name "var/elisp-autofmt-cache" user-emacs-directory))
  (setq elisp-autofmt-python-bin "/opt/homebrew/bin/python3")
  )
#+end_src

* 快捷键
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       D6B399A8-B6C6-474F-B63C-BC0C9E40C591
:END:
** region-bindings

[[https://github.com/andreyorst/region-bindings.el][andreyorst/region-bindings.el]]

#+begin_src emacs-lisp :tangle no

#+end_src

** 快捷键历史记录 keyfreq :Git:

Track Emacs commands frequency

#+begin_src emacs-lisp :tangle no
;; keyferq: 排除命令: exclude commands
;; abort-recursive-edit
;; ace-window
;; avy-goto-line
;; backward-char
;; clipboard-kill-ring-save
;; comint-previous-input
;; comint-send-input
;; delete-backward-char
;; describe-variable
;; electric-pair-delete-pair
;; eval-buffer
;; exit-minibuffer
;; ffip
;; forward-char
;; goto-line
;; hippie-expand
;; indent-new-comment-line
;; ispell-minor-check
;; js-mode
;; js2-line-break
;; kill-sentence
;; left-char
;; mac-mwheel-scroll
;; magit-next-line
;; magit-previous-line
;; markdown-exdent-or-delete
;; markdown-outdent-or-delete
;; minibuffer-complete
;; minibuffer-complete-and-exit
;; minibuffer-keyboard-quit
;; mouse-drag-region
;; mouse-set-point
;; move-beginning-of-line
;; move-end-of-line
;; my-company-number
;; my-setup-develop-environment
;; newline-and-indent
;; next-history-element
;; next-line
;; package-menu-execute
;; pcomplete
;; previous-history-element
;; previous-line
;; push-button
;; pwd
;; quit-window
;; recenter-top-bottom
;; right-char
;; rjsx-electric-gt
;; rjsx-electric-lt
;; shellcop-erase-buffer
;; smarter-move-beginning-of-line
;; suspend-frame
;; term-send-raw
;; turnon-keyfreq-mode
;; typescript-insert-and-indent
;; undefined ;; lambda function
;; wgrep-finish-edit
;; xterm-paste
;; yank
#+end_src

#+begin_src emacs-lisp :tangle no
;; keyfreq: 正则表达式排除模式, excluded regexp

;;         "^ace-jump-"
;;         "^backward-"
;;         "^company-"
;;         "^dired"
;;         "^evil-"
;;         "^forward-"
;;         "^general-dispatch-self-insert-command-"
;;         "^gnus-"
;;         "^ido-"
;;         "^isearch-"
;;         "^ivy-"
;;         "^keyboard-"
;;         "^keyfreq-"
;;         "^my-hydra-.*/body"
;;         "^next-"
;;         "^org-"
;;         "^paredit-"
;;         "^save-"
;;         "^scroll-"
;;         "^select-window-"
;;         "^undo-"
;;         "^web-mode"
;;         "^y-or-n-"
;;         "^yas-"
;;         "emms-"

#+end_src

#+begin_src emacs-lisp
;; keyfreq fork: keyfreq-html-v2 show keyboard heat map
(use-package keyfreq
  :ensure nil
  :defer 1
  :config
  (keyfreq-mode 1) ;; 启动插件包
  (keyfreq-autosave-mode 1) ;; 自动保存模式

  (setq keyfreq-folder
        (expand-file-name
         "lib/keyfreq"
         (concat user-emacs-directory)))

  (setq-default keyfreq-file
                (expand-file-name
                 "assets/keyfreq-log"
                 (concat user-emacs-directory)))

  (setq-default keyfreq-file-lock
                (expand-file-name
                 "var/keyfreq-log.lock"
                 (concat user-emacs-directory)))

  (setq keyfreq-excluded-commands
        '(
          mwheel-scroll
          org-self-insert-command
          self-insert-command
          ))

  ;; (setq keyfreq-excluded-regexp
  ;;       '(
  ;;         "^w3m-"
  ;;        ))

  ;; (defun turnon-keyfreq-mode ()
  ;;   "Turn on keyfreq."
  ;;   (interactive)
  ;;   (my-run-with-idle-timer 4 (lambda () ; lazy load keyfreq
  ;;                               (keyfreq-mode 1)
  ;;                               (keyfreq-autosave-mode 1))))
  )
#+end_src

** 空闲快捷键 free-keys

modifire prefix

#+begin_src text :tangle no
"A"
"C"
"H"
"M"
"S"
"s"
"A-C"
"A-H"
"A-M"
"A-S"
"A-s"
"C-S"
"M-S"
"M-s"
"S-s"
"C-M-S"
"C-M-s"
#+end_src

#+begin_src emacs-lisp
;; free-keys
;; {{{
(use-package free-keys
  :ensure nil
  :defer 2
  :config
  (setq free-keys-modifiers '(
                              ""
                              "C"     ; Ctrl/Capslock                 + <key>
                              "H"     ; Hyper/right_command           + <key>
                              "M"     ; Meta/ESC/Option               + <key>
                              "s"     ; super/Command                 + <key>
                              "ESC M" ; ESC             ESC             <key>
                              "C-c M" ; C-c             ESC             <key>
                              "C-x M" ; C-x             ESC             <key>
                              "C-H"   ; Ctrl          + right_command + <key>
                              "C-M"   ; Ctrl                          + <key>
                              "C-s"   ; Ctrl          + Command       + <key>
                              "H-M"   ; right_command + Option        + <key>
                              "H-s"   ; right_command + left_command  + <key>
                              ))
  )
;; }}}
#+end_src

** loophole

#+begin_src emacs-lisp :tangle no

#+end_src

** keycast

#+begin_src emacs-lisp
(use-package keycast
  :ensure nil
  :defer t
  :config
  (setq keycast-log-newest-first nil)
  )
#+end_src

