site-lisp/my-package.el

;; [[file:../package.org::*browser-hist][browser-hist:1]]
(use-package browser-hist
  :ensure nil
  :defer t
  :after (sqlite)
  :bind
  ("H-s H-s" . browser-hist-search)
  :config
  (setq browser-hist-db-paths
        '(
          (chrome . "$HOME/Library/Application Support/Google/Chrome/Default/History")
          (brave . "$HOME/Library/Application Support/BraveSoftware/Brave-Browser/Default/History")
          (firefox . "$HOME/Library/Application Support/Firefox/Profiles/*.default-release/places.sqlite")
          (safari . "$HOME/Library/Safari/History.db")
          ))
  (setq browser-hist-default-browser 'safari) ; FIXME
  :commands
  (browser-hist-search)
  )
;; browser-hist:1 ends here

;; [[file:../package.org::*代码分析][代码分析:1]]
(use-package elisp-depmap
  :ensure nil
  :init
  ;; read-symbol-positions-list is deleted from Emacs 29
  (defvar read-symbol-positions-list nil)
  :bind
  (
   ("C-c H-d" . elisp-depmap-graphviz-digraph)
   ("C-c H-g" . elisp-depmap-graphviz)
   ("C-c H-s" . elisp-depmap-makesummarytable)
   )
  :config
  (setq elisp-depmap-parse-hashtablesize 1024)
  (setq elisp-depmap-exec-file
        (expand-file-name "assets/elisp-dep-ana.dot" user-emacs-directory))
  )
;; 代码分析:1 ends here

;; [[file:../package.org::*格式化 elisp-autofmt][格式化 elisp-autofmt:1]]
(use-package elisp-autofmt
  :commands
  (elisp-autofmt-mode elisp-autofmt-buffer)
  :hook (emacs-lisp-mode . elisp-autofmt-mode)
  :config
  (setq elisp-autofmt-cache-directory
        (expand-file-name "var/elisp-autofmt-cache" user-emacs-directory))
  (setq elisp-autofmt-python-bin "/opt/homebrew/bin/python3")
  )
;; 格式化 elisp-autofmt:1 ends here

;; [[file:../package.org::*快捷键历史记录 keyfreq][快捷键历史记录 keyfreq:3]]
;; keyfreq fork: keyfreq-html-v2 show keyboard heat map
(use-package keyfreq
  :ensure nil
  :defer 1
  :config
  (keyfreq-mode 1) ;; 启动插件包
  (keyfreq-autosave-mode 1) ;; 自动保存模式

  (setq keyfreq-folder
        (expand-file-name
         "lib/keyfreq"
         (concat user-emacs-directory)))

  (setq-default keyfreq-file
                (expand-file-name
                 "assets/keyfreq-log"
                 (concat user-emacs-directory)))

  (setq-default keyfreq-file-lock
                (expand-file-name
                 "var/keyfreq-log.lock"
                 (concat user-emacs-directory)))

  (setq keyfreq-excluded-commands
        '(
          mwheel-scroll
          org-self-insert-command
          self-insert-command
          ))

  ;; (setq keyfreq-excluded-regexp
  ;;       '(
  ;;         "^w3m-"
  ;;        ))

  ;; (defun turnon-keyfreq-mode ()
  ;;   "Turn on keyfreq."
  ;;   (interactive)
  ;;   (my-run-with-idle-timer 4 (lambda () ; lazy load keyfreq
  ;;                               (keyfreq-mode 1)
  ;;                               (keyfreq-autosave-mode 1))))
  )
;; 快捷键历史记录 keyfreq:3 ends here

;; [[file:../package.org::*空闲快捷键 free-keys][空闲快捷键 free-keys:2]]
;; free-keys
;; {{{
(use-package free-keys
  :ensure nil
  :defer 2
  :config
  (setq free-keys-modifiers '(
                              ""
                              "C"     ; Ctrl/Capslock                 + <key>
                              "H"     ; Hyper/right_command           + <key>
                              "M"     ; Meta/ESC/Option               + <key>
                              "s"     ; super/Command                 + <key>
                              "ESC M" ; ESC             ESC             <key>
                              "C-c M" ; C-c             ESC             <key>
                              "C-x M" ; C-x             ESC             <key>
                              "C-H"   ; Ctrl          + right_command + <key>
                              "C-M"   ; Ctrl                          + <key>
                              "C-s"   ; Ctrl          + Command       + <key>
                              "H-M"   ; right_command + Option        + <key>
                              "H-s"   ; right_command + left_command  + <key>
                              ))
  )
;; }}}
;; 空闲快捷键 free-keys:2 ends here

;; [[file:../package.org::*keycast][keycast:1]]
(use-package keycast
  :ensure nil
  :defer t
  :config
  (setq keycast-log-newest-first nil)
  )
;; keycast:1 ends here

;; [[file:../package.org::*which-key + posframe][which-key + posframe:1]]
(use-package which-key
  :ensure nil
  :hook
  (
