package.org
** keycast + embark

#+begin_src emacs-lisp :tangle no
(defun store-action-key+cmd (cmd)
  (setq keycast--this-command-keys (this-single-command-keys)
        keycast--this-command cmd))

(advice-add 'embark-keymap-prompter :filter-return #'store-action-key+cmd)

(defun force-keycast-update (&rest _)
  (force-mode-line-update t))

(dolist (cmd '(embark-act embark-become))
  (advice-add cmd :before #'force-keycast-update))
#+end_src

** which-key + posframe

#+begin_src emacs-lisp
(use-package which-key
  :ensure nil
  :hook
  (
   (after-init . which-key-mode)
   ;; (repeat-mode . which-key-mode) ; :init (which-key-mode)
   )
  ;; :custom
  ;; for repeat-mode
  ;; Disable the built-in repeat-mode hinting
  ;; (repeat-echo-function 'ignore)
  :init
  ;; for repeat-mode
  ;; Spawn or hide a which-key popup
  ;; (advice-add
  ;;  'repeat-post-hook
  ;;  :after
  ;;  (defun repeat-help--which-key-popup ()
  ;;    (if-let ((cmd (or this-command real-this-command))
  ;;             (keymap (or repeat-map (repeat--command-property 'repeat-map))))
  ;;      (run-at-time
  ;;       0 nil
  ;;       (lambda ()
  ;;         (which-key--create-buffer-and-show nil (symbol-value keymap))))
  ;;      (which-key--hide-popup))))
  :config (setq which-key-popup-type 'minibuffer)
  (setq
   which-key-idle-delay 0.5
   which-key-idle-secondary-delay 0.5
   which-key-show-operator-state-maps t)
  )
#+end_src

#+begin_src emacs-lisp
(use-package which-key-posframe
  :ensure nil
  :config
  (which-key-posframe-mode)
  ;; (setq which-key-posframe-poshandler
  ;;       'posframe-poshandler-window-top-right-corner)
  )
#+end_src

** repeat-help

#+begin_src emacs-lisp
(use-package repeat-help
  :ensure nil
  :hook (repeat-mode . repeat-help-mode)
  :config
  (setq repeat-echo-function 'ignore)
  (setq repeat-help-popup-type 'which-key)
  )
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://karthinks.com/software/it-bears-repeating/
;; https://karthinks.com/software/a-consistent-structural-editing-interface/
(use-package which-key
  :ensure nil
  :hook
  (repeat-mode . repeat-help--which-key-popup)
  :custom
  ;; for repeat-mode
  ;; Disable the built-in repeat-mode hinting
  (repeat-echo-function 'ignore)
  ;; :init
  :config
  ;; for repeat-mode
  ;; Spawn or hide a which-key popup
  (advice-add
   'repeat-post-hook
   :after
   (defun repeat-help--which-key-popup ()
     (if-let ((cmd (or this-command real-this-command))
              (keymap (or repeat-map (repeat--command-property 'repeat-map))))
         (run-at-time
          0 nil
          (lambda ()
            (which-key--create-buffer-and-show nil (symbol-value keymap))))
       (which-key--hide-popup))))
  )
#+end_src

* Macro & 光标/鼠标/触控板
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       43CF0A72-38FD-4D18-9646-EF28FCF6687C
:END:

** iedit

#+begin_src emacs-lisp :tangle no

#+end_src

** multiple-cursors

#+begin_src emacs-lisp
;; multiple-cursors
;; {{{
;; multiple-cursors-mode-enabled-hook
;; multiple-cursors-mode-disabled-hook
(use-package multiple-cursors
  :bind (
         ("H-c H-a" . mc/edit-beginnings-of-lines)
         ("H-c H-e" . mc/edit-ends-of-lines)
         ("H-c H-l" . mc/edit-lines)
         ("H-c H-n" . mc/mark-next-like-this)
         ("H-c H-p" . mc/mark-previous-like-this)
         ("H-c H-h" . mc/mark-all-like-this)
         ([remap cua-rectangle-mark-mode] . set-rectangular-region-anchor)
         )
  :config
  (add-hook 'activate-mark-hook '(lambda ()
                                   (local-set-key
                                    (kbd "C-@")
                                    'set-rectangular-region-anchor)
                                   ))

  (add-hook 'deactivate-mark-hook '(lambda ()
                                     (local-unset-key
                                      (kbd "C-@"))
                                     ))
  )
;; }}}
#+end_src

** macrostep

https://github.com/joddie/macrostep

** markmacro

** 光标跳转: avy

https://karthinks.com/software/avy-can-do-anything

#+begin_src emacs-lisp
(use-package avy
  :ensure nil
  :bind
  ;; ("" . avy-goto-char-timer)
  ("H-j H-j"   . avy-goto-char)
  ("H-j 2"     . avy-goto-char-2)
  ("H-j H-k"   . avy-goto-line)
  ;; ("M-g w"   . avy-goto-word-1)
  ;; ("M-g e"   . avy-goto-word-0)
  ("C-c H-j" . avy-resume)
  :custom
  (avy-background t)
  (avy-keys '(?a ?s ?d ?f ?g ?h ?j ?l ?q ?e ?r ?u ?i ?p ?n))
  :config
  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)
  (setf (alist-get ?e avy-dispatch-alist) 'avy-action-embark)
  )
#+end_src

** 二分/模糊移动: bln-mode

#+begin_src emacs-lisp :tangle no
(use-package bln-mode
  :ensure nil
  ;; :config
  )

;; (defhydra hydra-bln ()
;;   "Binary line navigation mode"
;;   ("j" bln-backward-half "Backward in line")
;;   ("k" bln-forward-half "Forward in line")
;;   ("u" bln-backward-half-v "Backward in window")
;;   ("i" bln-forward-half-v "Forward in window")
;;   ("h" bln-backward-half-b "Backward in buffer")
;;   ("l" bln-forward-half-b "Forward in buffer"))
;; (define-key bln-mode-map (kbd "M-j") ’hydra-bln/body)
#+end_src

** goto-line-preview

#+begin_src emacs-lisp :tangle no
;; goto-line-preview
;; {{{
(use-package goto-line-preview
  :ensure nil
  :defer 2
  :bind
  ([remap goto-line] . goto-line-preview)
  )
;; }}}
#+end_src

** Hyperbole

** 右键菜单: embark

[[https://karthinks.com/software/fifteen-ways-to-use-embark/][Fifteen ways to use Embark | Karthinks]]

#+begin_src emacs-lisp
(use-package embark
  :ensure nil
  :defer 1
  :bind
  (
   ;; ("C-<return>" . embark-act)
   ("C-;"        . embark-act)
   ("H-M-o"      . embark-collect) ; equals `ESC H-o'
   ("M-."        . embark-dwim)
   ([remap describe-bindings]  . embark-bindings)
   ;; ("C-h B"      . embark-bindings)
   :map minibuffer-mode-map
   ;; ("C-c C-l" . embark-collect)
   ("H-o"     . embark-export)
   ;; ("C-c C-e" . embark-export)
   ;; ("C-d" . embark-act)
   )
  :custom
  ;; (embark-quit-after-action nil)
  ;; (embark-indicators '(embark-minimal-indicator
  ;;                      embark-highlight-indicator
  ;;                      ;; embark-verbose-indicator
  ;;                      embark-isearch-highlight-indicator
  ;;                      ))
  (embark-cycle-key ".")
  (embark-help-key "?")
  :config
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none))))

  (defvar embark--target-mode-timer nil)
  (defvar embark--target-mode-string "")

  (defun embark--target-mode-update ()
    (setq embark--target-mode-string
          (if-let (targets (embark--targets))
              (format "[%s%s] "
                      (propertize (symbol-name (plist-get (car targets) :type)) 'face 'bold)
                      (mapconcat (lambda (x) (format ", %s" (plist-get x :type)))
                                 (cdr targets)
                                 ""))
            "")))

  (define-minor-mode embark-target-mode
    "Shows the current targets in the modeline."
    :global t
    (setq mode-line-misc-info (assq-delete-all 'embark-target-mode mode-line-misc-info))
    (when embark--target-mode-timer
      (cancel-timer embark--target-mode-timer)
      (setq embark--target-mode-timer nil))
    (when embark-target-mode
      (push '(embark-target-mode (:eval embark--target-mode-string)) mode-line-misc-info)
      (setq embark--target-mode-timer
            (run-with-idle-timer 0.1 t #'embark--target-mode-update))))
  )
#+end_src

*** embark + consult

#+begin_src emacs-lisp
(use-package embark-consult
  :ensure nil
  :hook
  (embark-collect-mode . consult-preview-at-point-mode)
  )
#+end_src

*** embark + which-key

#+begin_src emacs-lisp :tangle no
(use-package embark
  :ensure nil
  :config
  (defun embark-which-key-indicator ()
    "An embark indicator that displays keymaps using which-key.
The which-key help message will show the type and value of the
current target followed by an ellipsis if there are further
targets."
    (lambda (&optional keymap targets prefix)
      (if (null keymap)
          (which-key--hide-popup-ignore-command)
        (which-key--show-keymap
         (if (eq (plist-get (car targets) :type) 'embark-become)
             "Become"
           (format "Act on %s '%s'%s"
                   (plist-get (car targets) :type)
                   (embark--truncate-target (plist-get (car targets) :target))
                   (if (cdr targets)
                       "…"
                     "")))
         (if prefix
             (pcase (lookup-key keymap prefix 'accept-default)
               ((and (pred keymapp) km) km)
               (_ (key-binding prefix 'accept-default)))
           keymap)
         nil
         nil
         t
         (lambda (binding) (not (string-suffix-p "-argument" (cdr binding))))))))

  (setq embark-indicators
        '(embark-which-key-indicator
          embark-highlight-indicator embark-isearch-highlight-indicator))

  (defun embark-hide-which-key-indicator (fn &rest args)
    "Hide the which-key indicator immediately when using the completing-read prompter."
    (which-key--hide-popup-ignore-command)
    (let ((embark-indicators
           (remq #'embark-which-key-indicator embark-indicators)))
      (apply fn args)))

  (advice-add
   #'embark-completing-read-prompter
   :around #'embark-hide-which-key-indicator))
#+end_src

* 字符/字符串/文本编辑
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       AC7651CB-507C-4F19-BD48-94C766A61A59
:END:

