site-lisp/my-package.el
   (after-init . which-key-mode)
   ;; (repeat-mode . which-key-mode) ; :init (which-key-mode)
   )
  ;; :custom
  ;; for repeat-mode
  ;; Disable the built-in repeat-mode hinting
  ;; (repeat-echo-function 'ignore)
  :init
  ;; for repeat-mode
  ;; Spawn or hide a which-key popup
  ;; (advice-add
  ;;  'repeat-post-hook
  ;;  :after
  ;;  (defun repeat-help--which-key-popup ()
  ;;    (if-let ((cmd (or this-command real-this-command))
  ;;             (keymap (or repeat-map (repeat--command-property 'repeat-map))))
  ;;      (run-at-time
  ;;       0 nil
  ;;       (lambda ()
  ;;         (which-key--create-buffer-and-show nil (symbol-value keymap))))
  ;;      (which-key--hide-popup))))
  :config (setq which-key-popup-type 'minibuffer)
  (setq
   which-key-idle-delay 0.5
   which-key-idle-secondary-delay 0.5
   which-key-show-operator-state-maps t)
  )
;; which-key + posframe:1 ends here

;; [[file:../package.org::*which-key + posframe][which-key + posframe:2]]
(use-package which-key-posframe
  :ensure nil
  :config
  (which-key-posframe-mode)
  ;; (setq which-key-posframe-poshandler
  ;;       'posframe-poshandler-window-top-right-corner)
  )
;; which-key + posframe:2 ends here

;; [[file:../package.org::*repeat-help][repeat-help:1]]
(use-package repeat-help
  :ensure nil
  :hook (repeat-mode . repeat-help-mode)
  :config
  (setq repeat-echo-function 'ignore)
  (setq repeat-help-popup-type 'which-key)
  )
;; repeat-help:1 ends here

;; [[file:../package.org::*multiple-cursors][multiple-cursors:1]]
;; multiple-cursors
;; {{{
;; multiple-cursors-mode-enabled-hook
;; multiple-cursors-mode-disabled-hook
(use-package multiple-cursors
  :bind (
         ("H-c H-a" . mc/edit-beginnings-of-lines)
         ("H-c H-e" . mc/edit-ends-of-lines)
         ("H-c H-l" . mc/edit-lines)
         ("H-c H-n" . mc/mark-next-like-this)
         ("H-c H-p" . mc/mark-previous-like-this)
         ("H-c H-h" . mc/mark-all-like-this)
         ([remap cua-rectangle-mark-mode] . set-rectangular-region-anchor)
         )
  :config
  (add-hook 'activate-mark-hook '(lambda ()
                                   (local-set-key
                                    (kbd "C-@")
                                    'set-rectangular-region-anchor)
                                   ))

  (add-hook 'deactivate-mark-hook '(lambda ()
                                     (local-unset-key
                                      (kbd "C-@"))
                                     ))
  )
;; }}}
;; multiple-cursors:1 ends here

;; [[file:../package.org::*光标跳转: avy][光标跳转: avy:1]]
(use-package avy
  :ensure nil
  :bind
  ;; ("" . avy-goto-char-timer)
  ("H-j H-j"   . avy-goto-char)
  ("H-j 2"     . avy-goto-char-2)
  ("H-j H-k"   . avy-goto-line)
  ;; ("M-g w"   . avy-goto-word-1)
  ;; ("M-g e"   . avy-goto-word-0)
  ("C-c H-j" . avy-resume)
  :custom
  (avy-background t)
  (avy-keys '(?a ?s ?d ?f ?g ?h ?j ?l ?q ?e ?r ?u ?i ?p ?n))
  :config
  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)
  (setf (alist-get ?e avy-dispatch-alist) 'avy-action-embark)
  )
;; 光标跳转: avy:1 ends here

;; [[file:../package.org::*右键菜单: embark][右键菜单: embark:1]]
(use-package embark
  :ensure nil
  :defer 1
  :bind
  (
   ;; ("C-<return>" . embark-act)
   ("C-;"        . embark-act)
   ("H-M-o"      . embark-collect) ; equals `ESC H-o'
   ("M-."        . embark-dwim)
   ([remap describe-bindings]  . embark-bindings)
   ;; ("C-h B"      . embark-bindings)
   :map minibuffer-mode-map
   ;; ("C-c C-l" . embark-collect)
   ("H-o"     . embark-export)
   ;; ("C-c C-e" . embark-export)
   ;; ("C-d" . embark-act)
   )
  :custom
  ;; (embark-quit-after-action nil)
  ;; (embark-indicators '(embark-minimal-indicator
  ;;                      embark-highlight-indicator
  ;;                      ;; embark-verbose-indicator
  ;;                      embark-isearch-highlight-indicator
  ;;                      ))
  (embark-cycle-key ".")
  (embark-help-key "?")
  :config
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none))))

  (defvar embark--target-mode-timer nil)
  (defvar embark--target-mode-string "")

  (defun embark--target-mode-update ()
    (setq embark--target-mode-string
          (if-let (targets (embark--targets))
              (format "[%s%s] "
                      (propertize (symbol-name (plist-get (car targets) :type)) 'face 'bold)
                      (mapconcat (lambda (x) (format ", %s" (plist-get x :type)))
                                 (cdr targets)
                                 ""))
            "")))

  (define-minor-mode embark-target-mode
    "Shows the current targets in the modeline."
    :global t
    (setq mode-line-misc-info (assq-delete-all 'embark-target-mode mode-line-misc-info))
    (when embark--target-mode-timer
      (cancel-timer embark--target-mode-timer)
      (setq embark--target-mode-timer nil))
    (when embark-target-mode
      (push '(embark-target-mode (:eval embark--target-mode-string)) mode-line-misc-info)
      (setq embark--target-mode-timer
            (run-with-idle-timer 0.1 t #'embark--target-mode-update))))
  )
;; 右键菜单: embark:1 ends here

;; [[file:../package.org::*embark + consult][embark + consult:1]]
(use-package embark-consult
  :ensure nil
  :hook
  (embark-collect-mode . consult-preview-at-point-mode)
  )
;; embark + consult:1 ends here

;; [[file:../package.org::*Unicode: modeline-char][Unicode: modeline-char:1]]
;; unicode
;; {{{
