package.org
** Unicode: modeline-char :Git:

#+begin_src emacs-lisp
;; unicode
;; {{{
(use-package modeline-char
  :ensure nil
  :hook
  (after-init . mlc-char-in-mode-line-mode-global)
  )
;; }}}
#+end_src

** 括号: puni

[[https://github.com/AmaiKinono/puni][AmaiKinono/puni]]

Structured editing (soft deletion, expression navigating & manipulating) that
supports many major modes out of box.

#+begin_src emacs-lisp
(use-package puni
  :ensure nil
  :defer t
  )
#+end_src

** 近义词/反义词等: parrot

[[https://github.com/dp12/parrot][dp12/parrot: A package to rotate text and party with parrots at the same time]]

#+begin_src emacs-lisp
(use-package parrot
  ;; :defer t
  :ensure nil
  :hook (after-init . parrot-mode)
  :bind (
         ;;
         ;; ("H-r k" . parrot-rotate-prev-word-at-point)
         ("H-k H-j" . parrot-rotate-prev-word-at-point)
         ;; ("H-r j" . parrot-rotate-next-word-at-point)
         ("H-k H-k" . parrot-rotate-next-word-at-point)

         )
  :config
  (parrot-set-parrot-type 'emacs)
  (setq parrot-rotate-dict
        '(
          ;; personal setting
          (:rot ("¥" "$" "￥"))
          (:rot ("nil" "t"))
          (:rot ("setq" "defvar"))
          ;;
          (:rot ("alpha" "beta") :caps t :lower nil)
          ;; => rotations are "Alpha" "Beta"

          (:rot ("snek" "snake" "stawp"))
          ;; => rotations are "snek" "snake" "stawp"

          (:rot ("yes" "no") :caps t :upcase t)
          ;; => rotations are "yes" "no", "Yes" "No", "YES" "NO"

          (:rot ("&" "|"))
          ;; => rotations are "&" "|"

          ;; default dictionary starts here ('v')
          (:rot ("begin" "end") :caps t :upcase t)
          (:rot ("enable" "disable") :caps t :upcase t)
          (:rot ("enter" "exit") :caps t :upcase t)
          (:rot ("forward" "backward") :caps t :upcase t)
          (:rot ("front" "rear" "back") :caps t :upcase t)
          (:rot ("get" "set") :caps t :upcase t)
          (:rot ("high" "low") :caps t :upcase t)
          (:rot ("in" "out") :caps t :upcase t)
          (:rot ("left" "right") :caps t :upcase t)
          (:rot ("min" "max") :caps t :upcase t)
          (:rot ("on" "off") :caps t :upcase t)
          (:rot ("prev" "next"))
          (:rot ("start" "stop") :caps t :upcase t)
          (:rot ("true" "false") :caps t :upcase t)
          (:rot ("&&" "||"))
          (:rot ("==" "!="))
          (:rot ("." "->"))
          (:rot ("if" "cond" "else" "elif"))
          (:rot ("ifdef" "ifndef"))
          (:rot ("int8_t" "int16_t" "int32_t" "int64_t"))
          (:rot ("uint8_t" "uint16_t" "uint32_t" "uint64_t"))
          (:rot ("0" "1" "2" "3" "4" "5" "6" "7" "8" "9"))
          (:rot ("1st" "2nd" "3rd" "4th" "5th" "6th" "7th" "8th" "9th" "10th"))
          )
        )
  )
#+end_src

** Fuck :Git:

#+begin_src emacs-lisp :tangle no
;; fuck
;; {{{
(require 'fuck)
(keymap-global-set "H-k" #'fuck)
;; }}}
#+end_src

** 大小写

** 中英文空格: pangu-spacing                                        :format:

#+begin_src emacs-lisp
(use-package pangu-spacing
  :defer 3
  :custom
  (pangu-spacing-inhibit-mode-alist
   '(eshell-mode shell-mode term-mode fundamental-mode))
  :config
  (global-pangu-spacing-mode 1)
  (setq pangu-spacing-real-insert-separtor t))
#+end_src

** 字符统计 advance-words-count :Git:

[[https://github.com/LdBeth/advance-words-count.el][LdBeth/advance-words-count.el: Extended `count-words' function]]

#+begin_src emacs-lisp
(use-package advance-words-count
  :ensure nil
  ;; :defer 2
  :bind
  ("C-c w c" . advance-words-count)
  )
#+end_src

** combobulate :Git:

#+begin_src emacs-lisp :tangle no
(use-package combobulate
  ;; Ensure `combobulate-mode` is activated when you launch a mode it supports
  :hook
  ((python-mode . combobulate-mode)
   ;; (js-mode . combobulate-mode)
   ;; (typescript-mode . combobulate-mode)
   ))
#+end_src

* 正则表达式
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       34BEAD6F-6451-44D4-8B8F-73BA5B029B69
:END:

#+begin_src emacs-lisp :tangle no
;; whatthefuck
;; whatthehack
#+end_src

** visual-regexp

#+begin_src emacs-lisp
(use-package visual-regexp
  :ensure nil
  :defer 1
  :bind
  (
   ("C-c r e" . vr/query-replace)
   ("C-c r r" . vr/replace)
   ("C-c m m" . vr/mc-mark)        ; for multiple-cursors
   )
  )
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package visual-regexp-steroids
  :ensure nil
  :defer 1
  :bind
  (
   :map esc-map
   ("C-r" . vr/isearch-backward)
   ("C-s" . vr/isearch-forward)
   )
  ;; :config
  ;;  (setq vr/engine 'pcre2el) ; emacs python
  ;; (defvar vr--command-python-default
  ;;   (format
  ;;    "python3 %s"
  ;;    (expand-file-name "regexp.py" (file-name-directory load-file-name))))
  )
#+end_src

** pcre2el

[[https://github.com/joddie/pcre2el][joddie/pcre2el: convert between PCRE, Emacs and rx regexp syntax]]

| Convert from | convert to |
|--------------+------------|
| ELISP        | RX         |
| ELISP        | SRE        |
| ELISP        | string     |
| PCRE         | ELISP      |
| PCRE         | RX         |
| PCRE         | SRE        |
| PCRE         | string     |
| RX           | ELISP      |
| RX           | PCRE       |
| RX           | SRE        |

test

Why python code block is tangled when without =:tangle no= ?

#+begin_src python :tangle no
re="(([\u2e80-\u9fff]+)([\n\r]{1,2})?([\s\t])?(([\u2e80-\u9fff]+)|(\w)+)([\s\t])?)"
#+end_src

#+begin_src emacs-lisp :tangle no
(submatch
 (submatch
  (+ (any (48 . 117)))
  )
 (\?
  (submatch (* 1 2 (any 10 13)))
  )
 (\?
  (submatch (any 9 10 12 13 32))
  )
 (submatch (or
            (submatch
             (+ (any (48 . 117))))
            (+
             (submatch (any 95 alnum))
             )
            )
           )
 (\?
  (submatch (any 9 10 12 13 32))
  )
 )
#+end_src

** xr

* 选择 & region
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       A1BE32E1-FC11-4644-A1BF-1B2EF86C7CF3
:END:

** zones

#+begin_src emacs-lisp :tangle no
(use-package zones
  :ensure nil
  :defer t
  )
#+end_src

** selected

#+begin_src emacs-lisp :tangle no
(use-package selected
  :diminish selected-minor-mode
  :demand t   ; So we can use global mode enable in :config
  :commands
  (selected-global-mode selected-minor-mode) ; redundant?
  :bind (
         :map selected-keymap           ; bindings for all active regions
         ("q" . selected-off)
         ("u" . upcase-region)
         ("d" . downcase-region)
         )
  :config
  (selected-global-mode)
  )
#+end_src

** expand-region

#+begin_src emacs-lisp
;; expand-region
;; {{{
(keymap-global-unset "C-=")
(keymap-global-unset "C--")
(use-package expand-region
  :bind
  (
   ("C-=" . er/expand-region)
   ("C--" . er/contract-region)
   )
  :config
  (defun treesit-mark-bigger-node ()
    (let* ((root (treesit-buffer-root-node))
           (node
            (treesit-node-descendant-for-range
             root (region-beginning) (region-end)))
           (node-start (treesit-node-start node))
           (node-end (treesit-node-end node)))
      ;; Node fits the region exactly. Try its parent node instead.
      (when (and (= (region-beginning) node-start) (= (region-end) node-end))
        (when-let ((node (treesit-node-parent node)))
          (setq
           node-start (treesit-node-start node)
           node-end (treesit-node-end node))))
      (set-mark node-end)
      (goto-char node-start)))

  (add-to-list 'er/try-expand-list 'treesit-mark-bigger-node))
;; }}}
#+end_src

** symbol-overlay

#+begin_src emacs-lisp
;; symbol-overlay
;; {{{
(use-package symbol-overlay
  :bind(
        ("M-I" . symbol-overlay-remove-all)
        ("M-i"  . symbol-overlay-put) ; 高亮或取消高亮当前 symbol
        ("M-n"  . symbol-overlay-switch-forward)
        ("M-p"  . symbol-overlay-switch-backward)
        ;; ("<f7>" . symbol-overlay-mode)
        ;; ("<f8>" . symbol-overlay-remove-all)
        :map symbol-overlay-map
        ;; quit
        ("q" . symbol-overlay-remove-all)
        ("<escape>" . symbol-overlay-remove-all)
        ;; jump/move/scope
        ("n" . symbol-overlay-jump-next)
        ("p" . symbol-overlay-jump-prev)
        ("<" . symbol-overlay-jump-first)
        (">" . symbol-overlay-jump-last)
        ("d" . symbol-overlay-jump-to-definition) ; 跳转到定义
        ("e" . symbol-overlay-echo-mark)          ; 撤销上一次跳转
        ("t" . symbol-overlay-toggle-in-scope)    ; 切换高亮范围到作用域
        ;; copy/edit/search/rename/replace
        ("c" . symbol-overlay-save-symbol)        ; 复制当前 symbol
        ("r" . symbol-overlay-rename)
        ("R" . symbol-overlay-query-replace)      ; 查找替换 symbol
        ("s" . symbol-overlay-isearch-literally)  ; 切换为 isearch 并搜索 symbol
        ;; toggle
        ("i" . symbol-overlay-put)                ; 高亮或取消高亮当前 symbol
        )
  )
;; }}}
#+end_src

