site-lisp/my-package.el
(use-package modeline-char
  :ensure nil
  :hook
  (after-init . mlc-char-in-mode-line-mode-global)
  )
;; }}}
;; Unicode: modeline-char:1 ends here

;; [[file:../package.org::*括号: puni][括号: puni:1]]
(use-package puni
  :ensure nil
  :defer t
  )
;; 括号: puni:1 ends here

;; [[file:../package.org::*近义词/反义词等: parrot][近义词/反义词等: parrot:1]]
(use-package parrot
  ;; :defer t
  :ensure nil
  :hook (after-init . parrot-mode)
  :bind (
         ;;
         ;; ("H-r k" . parrot-rotate-prev-word-at-point)
         ("H-k H-j" . parrot-rotate-prev-word-at-point)
         ;; ("H-r j" . parrot-rotate-next-word-at-point)
         ("H-k H-k" . parrot-rotate-next-word-at-point)

         )
  :config
  (parrot-set-parrot-type 'emacs)
  (setq parrot-rotate-dict
        '(
          ;; personal setting
          (:rot ("¥" "$" "￥"))
          (:rot ("nil" "t"))
          (:rot ("setq" "defvar"))
          ;;
          (:rot ("alpha" "beta") :caps t :lower nil)
          ;; => rotations are "Alpha" "Beta"

          (:rot ("snek" "snake" "stawp"))
          ;; => rotations are "snek" "snake" "stawp"

          (:rot ("yes" "no") :caps t :upcase t)
          ;; => rotations are "yes" "no", "Yes" "No", "YES" "NO"

          (:rot ("&" "|"))
          ;; => rotations are "&" "|"

          ;; default dictionary starts here ('v')
          (:rot ("begin" "end") :caps t :upcase t)
          (:rot ("enable" "disable") :caps t :upcase t)
          (:rot ("enter" "exit") :caps t :upcase t)
          (:rot ("forward" "backward") :caps t :upcase t)
          (:rot ("front" "rear" "back") :caps t :upcase t)
          (:rot ("get" "set") :caps t :upcase t)
          (:rot ("high" "low") :caps t :upcase t)
          (:rot ("in" "out") :caps t :upcase t)
          (:rot ("left" "right") :caps t :upcase t)
          (:rot ("min" "max") :caps t :upcase t)
          (:rot ("on" "off") :caps t :upcase t)
          (:rot ("prev" "next"))
          (:rot ("start" "stop") :caps t :upcase t)
          (:rot ("true" "false") :caps t :upcase t)
          (:rot ("&&" "||"))
          (:rot ("==" "!="))
          (:rot ("." "->"))
          (:rot ("if" "cond" "else" "elif"))
          (:rot ("ifdef" "ifndef"))
          (:rot ("int8_t" "int16_t" "int32_t" "int64_t"))
          (:rot ("uint8_t" "uint16_t" "uint32_t" "uint64_t"))
          (:rot ("0" "1" "2" "3" "4" "5" "6" "7" "8" "9"))
          (:rot ("1st" "2nd" "3rd" "4th" "5th" "6th" "7th" "8th" "9th" "10th"))
          )
        )
  )
;; 近义词/反义词等: parrot:1 ends here

;; [[file:../package.org::*中英文空格: pangu-spacing][中英文空格: pangu-spacing:1]]
(use-package pangu-spacing
  :defer 3
  :custom
  (pangu-spacing-inhibit-mode-alist
   '(eshell-mode shell-mode term-mode fundamental-mode))
  :config
  (global-pangu-spacing-mode 1)
  (setq pangu-spacing-real-insert-separtor t))
;; 中英文空格: pangu-spacing:1 ends here

;; [[file:../package.org::*字符统计 advance-words-count][字符统计 advance-words-count:1]]
(use-package advance-words-count
  :ensure nil
  ;; :defer 2
  :bind
  ("C-c w c" . advance-words-count)
  )
;; 字符统计 advance-words-count:1 ends here

;; [[file:../package.org::*visual-regexp][visual-regexp:1]]
(use-package visual-regexp
  :ensure nil
  :defer 1
  :bind
  (
   ("C-c r e" . vr/query-replace)
   ("C-c r r" . vr/replace)
   ("C-c m m" . vr/mc-mark)        ; for multiple-cursors
   )
  )
;; visual-regexp:1 ends here

;; [[file:../package.org::*expand-region][expand-region:1]]
;; expand-region
;; {{{
(keymap-global-unset "C-=")
(keymap-global-unset "C--")
(use-package expand-region
  :bind
  (
   ("C-=" . er/expand-region)
   ("C--" . er/contract-region)
   )
  :config
  (defun treesit-mark-bigger-node ()
    (let* ((root (treesit-buffer-root-node))
           (node
            (treesit-node-descendant-for-range
             root (region-beginning) (region-end)))
           (node-start (treesit-node-start node))
           (node-end (treesit-node-end node)))
      ;; Node fits the region exactly. Try its parent node instead.
      (when (and (= (region-beginning) node-start) (= (region-end) node-end))
        (when-let ((node (treesit-node-parent node)))
          (setq
           node-start (treesit-node-start node)
           node-end (treesit-node-end node))))
      (set-mark node-end)
      (goto-char node-start)))

  (add-to-list 'er/try-expand-list 'treesit-mark-bigger-node))
;; }}}
;; expand-region:1 ends here

;; [[file:../package.org::*symbol-overlay][symbol-overlay:1]]
;; symbol-overlay
;; {{{
(use-package symbol-overlay
  :bind(
        ("M-I" . symbol-overlay-remove-all)
        ("M-i"  . symbol-overlay-put) ; 高亮或取消高亮当前 symbol
        ("M-n"  . symbol-overlay-switch-forward)
        ("M-p"  . symbol-overlay-switch-backward)
        ;; ("<f7>" . symbol-overlay-mode)
        ;; ("<f8>" . symbol-overlay-remove-all)
        :map symbol-overlay-map
        ;; quit
        ("q" . symbol-overlay-remove-all)
        ("<escape>" . symbol-overlay-remove-all)
        ;; jump/move/scope
        ("n" . symbol-overlay-jump-next)
        ("p" . symbol-overlay-jump-prev)
        ("<" . symbol-overlay-jump-first)
        (">" . symbol-overlay-jump-last)
        ("d" . symbol-overlay-jump-to-definition) ; 跳转到定义
        ("e" . symbol-overlay-echo-mark)          ; 撤销上一次跳转
        ("t" . symbol-overlay-toggle-in-scope)    ; 切换高亮范围到作用域
        ;; copy/edit/search/rename/replace
        ("c" . symbol-overlay-save-symbol)        ; 复制当前 symbol
        ("r" . symbol-overlay-rename)
        ("R" . symbol-overlay-query-replace)      ; 查找替换 symbol
        ("s" . symbol-overlay-isearch-literally)  ; 切换为 isearch 并搜索 symbol
        ;; toggle
        ("i" . symbol-overlay-put)                ; 高亮或取消高亮当前 symbol
        )
  )
;; }}}
;; symbol-overlay:1 ends here
