package.org
** consult

#+begin_src emacs-lisp
;; consult
;; {{{
;; Example configuration for Consult
(use-package consult
  :ensure nil
  :after org
  :defer 1
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind
  (
   ("C-c H-f H-d" . consult-find)
   ("C-c H-k" . consult-mark)
   ("C-c H-l" . consult-line)
   ("C-c H-r H-e" . consult-grep)
   ("C-c H-r H-g" . consult-ripgrep)
   ([remap bookmark-jump] . consult-bookmark)
   ([remap goto-line] . consult-goto-line)
   ([remap imenu] . consult-imenu)
   ([remap load-theme] . consult-theme)
   ([remap locate] . consult-locate)
   ([remap man] . consult-man)
   ([remap recentf-open-files] . consult-recent-file)
   ([remap repeat-complex-command] . consult-complex-command)
   ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
   ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
   ([remap switch-to-buffer] . consult-buffer)
   ([remap yank-pop] . consult-yank-pop)
   ;; ([remap apropos] . consult-apropos)
   ;; ;; ("C-x H-l" . consult-focus-lines)
   ;; ;; C-c bindings (mode-specific-map)
   ("C-c M-x" . consult-mode-command)
   ;; ("C-c h" . consult-history)
   ;; ("C-c k" . consult-kmacro)
   ;; ("C-c i" . consult-info)
   ;; ([remap Info-search] . consult-info)
   ;; ;; C-x bindings (ctl-x-map)
   ;; ("C-x p b" . consult-project-buffer) ;; orig. project-switch-to-buffer
   ;; ;; Custom M-# bindings for fast register access
   ;; ("M-#" . consult-register-load)
   ;; ("M-'" . consult-register-store) ;; orig. abbrev-prefix-mark (unrelated)
   ;; ("C-M-#" . consult-register)
   ;; ;; Other custom bindings

   ;; ;; M-g bindings (goto-map)
   ;; ("M-g e" . consult-compile-error)
   ;; ("M-g f" . consult-flymake)     ;; Alternative: consult-flycheck
   ;; ("M-g g" . consult-goto-line)   ;; orig. goto-line
   ;; ("M-g M-g" . consult-goto-line) ;; orig. goto-line
   ;; ("M-g o" . consult-outline)     ;; Alternative: consult-org-heading
   ;; ("M-g m" . consult-mark)
   ;; ("M-g k" . consult-global-mark)

   ;; ("M-g I" . consult-imenu-multi)
   ;; ;; M-s bindings (search-map)
   ;; ("M-s d" . consult-find)
   ;; ("M-s D" . consult-locate)
   ;; ("M-s g" . consult-grep)
   ;; ("M-s G" . consult-git-grep)
   ;; ("M-s r" . consult-ripgrep)
   ;; ("M-s l" . consult-line) ; goto line with string
   ;; ("M-s L" . consult-line-multi)
   ;; ("M-s k" . consult-keep-lines)
   ;; ("M-s u" . consult-focus-lines)
   ;; Isearch integration
   ;; ("M-s e" . consult-isearch-history)
   ("M-s s" . consult-isearch-history)
   :map org-mode-map
   ([remap imenu]          . consult-org-heading)
   ([remap consult-imenu]  . consult-org-heading)
   ([remap org-goto]       . consult-org-heading) ; C-c C-j
   :map prog-mode-map
   ("C-c C-j"  . consult-outline)
   :map isearch-mode-map
   ([remap isearch-edit-string] . consult-isearch-history)
   ("M-s l" . consult-line) ;; needed by consult-line to detect isearch
   ("M-s L" . consult-line-multi) ;; needed by consult-line to detect isearch
   ;; Minibuffer history
   :map minibuffer-local-map
   ("M-s" . consult-history)  ;; orig. next-matching-history-element
   ("H-h" . consult-history) ;; orig. previous-matching-history-element
   )
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  ;; macOS locate doesn't support `--ignore-case --existing' args.
  (setq consult-locate-args (pcase system-type
                              ('gnu/linux
                               "locate --ignore-case --existing --regex")
                              ('darwin
                               "mdfind -name")
                              ))
  :config

  (setq consult-narrow-key "<" ;; (kbd "C-+")
        consult-async-min-input 2
        consult-async-refresh-delay 0.15
        consult-async-input-throttle 0.2
        consult-async-input-debounce 0.2)
  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key (kbd "M-."))
  ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  ;; (consult-customize
  ;;  consult-theme
  ;;  consult-ripgrep consult-git-grep consult-grep
  ;;  consult-bookmark consult-recent-file consult-xref
  ;;  consult--source-bookmark consult--source-file-register
  ;;  consult--source-recent-file consult--source-project-recent-file
  ;; consult-completion-in-region
  ;; :completion-styles (basic partial-completion flex) ; FIXME
  ;; :cycle-threshold 3
  ;; )

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  ;; There are multiple reasonable alternatives to chose from.
;;;; 1. project.el (the default)
  ;; (setq consult-project-function #'consult--default-project--function)
;;;; 2. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
;;;; 3. vc.el (vc-root-dir)
  ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
;;;; 4. locate-dominating-file
  ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))

  ;; Use `consult-completion-in-region' if Vertico is enabled.
  ;; Otherwise use the default `completion--in-region' function.
  ;; (setq-default completion-in-region-function
  ;;               (lambda (&rest args)
  ;;                 (apply (if vertico-mode
  ;;                            #'consult-completion-in-region
  ;;                          #'completion--in-region)
  ;;                        args)))
  )
;; }}}
#+end_src

#+begin_src emacs-lisp :tangle no
(setq consult-ripgrep-args
      "rg --sortr path --null --line-buffered
--color=never --max-columns=1000 --path-separator /
--smart-case --no-heading --line-number --multiline --type org ."
      )
#+end_src

#+begin_src emacs-lisp
(use-package consult-dir
  :ensure nil
  ;; :after (consult vertico)
  :bind
  (
   ([remap list-directory] . consult-dir)
   :map  vertico-map ; minibuffer-local-completion-map
   ("C-c C-d" . consult-dir)
   ("C-c C-j" . consult-dir-jump-file)
   )
  :config
  (setq consult-dir-default-command 'consult-find)
  )
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package consult-project-extra
  :straight t
  :bind
  (
   ("C-c p f" . consult-project-extra-find) ; project-find-regexp
   ("C-c p o" . consult-project-extra-find-other-window)
   )
  )

;; ;; git@github.com:jdtsmith/consult-jump-project.git
;; (use-package consult-jump-project
;;   :load-path "~/code/emacs/consult-jump-project/"
;;   :straight
;;   (consult-jump-project
;;    :type git
;;    :host github
;;    :repo "jdtsmith/consult-jump-project"
;;    )
;;   :custom
;;   (consult-jump-direct-jump-modes '(dired-mode))
;;   :bind
;;   ("C-x p j" . consult-jump-project)
;;   )
#+end_src

#+begin_src emacs-lisp
(use-package consult-yasnippet
  :ensure nil
  ;; :defer t
  ;; :demand t
  :after (consult yasnippet)
  )
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://emacs-china.org/t/helm-ivy-selectrum-completions-buffer/17148/26
(use-package embark
  :ensure t
  :bind
  (:map
   minibuffer-local-completion-map
   ;; 默认情况下 TAB 绑定的是 minibuffer-complete，但是在补全候选项数量超
   ;; 过 completion-cycle-threshold 的限制时， minibuffer-complete 则不会
   ;; 遍历所有的补全候选项。我个人感觉这种行为有点不符合直觉，TAB 如果可以
   ;; 无视 completion-cycle-threshold 限制，不论数量多少都进行遍历。正好这
   ;; 个行为就是对应的 minibuffer-force-complete 函数.
   ("TAB" . minibuffer-force-complete)
   ;; 这个键绑定就是为了解决在执行 consult-ripgrep 异步命令时如何有效的选
   ;; 择补全项。在前面提到，如果在 consult-ripgrep 时按 TAB (即
   ;; minibuffer-force-complete) 会覆盖用户的输入，这样就无法对输入进行二
   ;; 次修改了，显然是反直觉的。于是我就给 C-o 赋于了这样的一种能力: 在
   ;; minibuffer 里时如果想浏览 `*Embark Collect Completions*` buffer 的内
   ;; 容，按一下 C-o 就会跳到那个窗口中。然后就可以使用正常浏览 buffer 的
   ;; 方式浏览对应的补全项了。如果正好的对应的结果的话，也是按一下 RET 就
   ;; 好了。如果想二次修改输入，那么当前的 `*Embark Collect Completions*`
   ;; buffer 回到 minibuffer 也只需要再按一下 C-o 即可。我个人感觉这种处理
   ;; 方式更加满足一般人的需求，而不是像 oantolin 那样直接用
   ;; embark-collect-snapshot 来浏览结果，毕竟这样二次修改搜索内容。
   ("C-o" . toggle-between-minibuffer-and-embark-collect-completions)
   ("SPC" . nil))
  ;; 这里就是关键的一个了，在 minibuffer 建立的时候，如果用户有输入那么自
  ;; 动就打开 embark 的 embark-collect-completions 功能。这里除了可以是
  ;; embark-collect-completions-after-input 外还可以是
  ;; embark-collect-completions-after-delay. 如字面意思，一个是在有用户输
  ;; 入后，一个是在等待了一段时间后。
  ;;
  ;; 这里有一个小插曲。如果同时开启了 `minibuffer-eldef-shorten-default`
  ;; 和 `minibuffer-electric-default-mode`，C-h v 时会发现即使用户没有输
  ;; 入，在使用 `embark-collect-completions-after-input` 的情况下它过一段
  ;; 时间还是会弹出来对应的窗口。这是因为
  ;; `minibuffer-eldef-shorten-default` 在实现的时间会修改 minibuffer
  ;; prompt, 所以自然也就会让 `embark` 认为有用户输入了。因此规避的措施是
  ;; 关闭 `minibuffer-eldef-shorten-default`.
  :hook
  ((minibuffer-setup . embark-collect-completions-after-input)
   ;; 令 `*Embark Collect Completion*` 的窗口最大不超过当前 frame 的 40%。
   ;; 不然一个补全窗口占据太多视野功能就有点过了.
   (embark-collect-post-revert . resize-embark-collect-completions))
  :config
  (defun resize-embark-collect-completions ()
    (fit-window-to-buffer (get-buffer-window) (floor (* 0.4 (frame-height))) 1))

  (defun toggle-between-minibuffer-and-embark-collect-completions ()
    (interactive)
    (let ((w
           (if (eq (active-minibuffer-window) (selected-window))
               (get-buffer-window "*Embark Collect Completions*")
             (active-minibuffer-window))))
      (when (window-live-p w)
        (select-window w t)
        (select-frame-set-input-focus (selected-frame) t))))

  ;; evil 用户才需要这个，不然就可以定义在 use-package 的 :map 里了
  (with-eval-after-load 'evil-collection
    (evil-collection-define-key
     'normal
     'embark-collect-mode-map
     (kbd "C-o")
     'toggle-between-minibuffer-and-embark-collect-completions))

  ;; 不显示 `*Embark Collect Completions*` 窗口的 modeline，看起来简洁一点
  (add-to-list
   'display-buffer-alist
   '("\\*Embark Collect \\(Live\\|Completions\\)\\*"
     (display-buffer-at-bottom)
     (window-parameters . ((no-other-window . t) (mode-line-format . none)))))
  :custom
  ;; 永远使用单列来显示补全候选项
  (embark-collect-initial-view-alist '((t . list)))
  (embark-collect-live-initial-delay 0.15)
  (embark-collect-live-update-delay 0.15))
#+end_src

