site-lisp/my-package.el
;; Example configuration for Consult
(use-package consult
  :ensure nil
  :after org
  :defer 1
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind
  (
   ("C-c H-f H-d" . consult-find)
   ("C-c H-k" . consult-mark)
   ("C-c H-l" . consult-line)
   ("C-c H-r H-e" . consult-grep)
   ("C-c H-r H-g" . consult-ripgrep)
   ([remap bookmark-jump] . consult-bookmark)
   ([remap goto-line] . consult-goto-line)
   ([remap imenu] . consult-imenu)
   ([remap load-theme] . consult-theme)
   ([remap locate] . consult-locate)
   ([remap man] . consult-man)
   ([remap recentf-open-files] . consult-recent-file)
   ([remap repeat-complex-command] . consult-complex-command)
   ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
   ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
   ([remap switch-to-buffer] . consult-buffer)
   ([remap yank-pop] . consult-yank-pop)
   ;; ([remap apropos] . consult-apropos)
   ;; ;; ("C-x H-l" . consult-focus-lines)
   ;; ;; C-c bindings (mode-specific-map)
   ("C-c M-x" . consult-mode-command)
   ;; ("C-c h" . consult-history)
   ;; ("C-c k" . consult-kmacro)
   ;; ("C-c i" . consult-info)
   ;; ([remap Info-search] . consult-info)
   ;; ;; C-x bindings (ctl-x-map)
   ;; ("C-x p b" . consult-project-buffer) ;; orig. project-switch-to-buffer
   ;; ;; Custom M-# bindings for fast register access
   ;; ("M-#" . consult-register-load)
   ;; ("M-'" . consult-register-store) ;; orig. abbrev-prefix-mark (unrelated)
   ;; ("C-M-#" . consult-register)
   ;; ;; Other custom bindings

   ;; ;; M-g bindings (goto-map)
   ;; ("M-g e" . consult-compile-error)
   ;; ("M-g f" . consult-flymake)     ;; Alternative: consult-flycheck
   ;; ("M-g g" . consult-goto-line)   ;; orig. goto-line
   ;; ("M-g M-g" . consult-goto-line) ;; orig. goto-line
   ;; ("M-g o" . consult-outline)     ;; Alternative: consult-org-heading
   ;; ("M-g m" . consult-mark)
   ;; ("M-g k" . consult-global-mark)

   ;; ("M-g I" . consult-imenu-multi)
   ;; ;; M-s bindings (search-map)
   ;; ("M-s d" . consult-find)
   ;; ("M-s D" . consult-locate)
   ;; ("M-s g" . consult-grep)
   ;; ("M-s G" . consult-git-grep)
   ;; ("M-s r" . consult-ripgrep)
   ;; ("M-s l" . consult-line) ; goto line with string
   ;; ("M-s L" . consult-line-multi)
   ;; ("M-s k" . consult-keep-lines)
   ;; ("M-s u" . consult-focus-lines)
   ;; Isearch integration
   ;; ("M-s e" . consult-isearch-history)
   ("M-s s" . consult-isearch-history)
   :map org-mode-map
   ([remap imenu]          . consult-org-heading)
   ([remap consult-imenu]  . consult-org-heading)
   ([remap org-goto]       . consult-org-heading) ; C-c C-j
   :map prog-mode-map
   ("C-c C-j"  . consult-outline)
   :map isearch-mode-map
   ([remap isearch-edit-string] . consult-isearch-history)
   ("M-s l" . consult-line) ;; needed by consult-line to detect isearch
   ("M-s L" . consult-line-multi) ;; needed by consult-line to detect isearch
   ;; Minibuffer history
   :map minibuffer-local-map
   ("M-s" . consult-history)  ;; orig. next-matching-history-element
   ("H-h" . consult-history) ;; orig. previous-matching-history-element
   )
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  ;; macOS locate doesn't support `--ignore-case --existing' args.
  (setq consult-locate-args (pcase system-type
                              ('gnu/linux
                               "locate --ignore-case --existing --regex")
                              ('darwin
                               "mdfind -name")
                              ))
  :config

  (setq consult-narrow-key "<" ;; (kbd "C-+")
        consult-async-min-input 2
        consult-async-refresh-delay 0.15
        consult-async-input-throttle 0.2
        consult-async-input-debounce 0.2)
  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key (kbd "M-."))
  ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  ;; (consult-customize
  ;;  consult-theme
  ;;  consult-ripgrep consult-git-grep consult-grep
  ;;  consult-bookmark consult-recent-file consult-xref
  ;;  consult--source-bookmark consult--source-file-register
  ;;  consult--source-recent-file consult--source-project-recent-file
  ;; consult-completion-in-region
  ;; :completion-styles (basic partial-completion flex) ; FIXME
  ;; :cycle-threshold 3
  ;; )

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  ;; There are multiple reasonable alternatives to chose from.
;;;; 1. project.el (the default)
  ;; (setq consult-project-function #'consult--default-project--function)
;;;; 2. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
;;;; 3. vc.el (vc-root-dir)
  ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
;;;; 4. locate-dominating-file
  ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))

  ;; Use `consult-completion-in-region' if Vertico is enabled.
  ;; Otherwise use the default `completion--in-region' function.
  ;; (setq-default completion-in-region-function
  ;;               (lambda (&rest args)
  ;;                 (apply (if vertico-mode
  ;;                            #'consult-completion-in-region
  ;;                          #'completion--in-region)
  ;;                        args)))
  )
;; }}}
;; consult:1 ends here

;; [[file:../package.org::*consult][consult:3]]
(use-package consult-dir
  :ensure nil
  ;; :after (consult vertico)
  :bind
  (
   ([remap list-directory] . consult-dir)
   :map  vertico-map ; minibuffer-local-completion-map
   ("C-c C-d" . consult-dir)
   ("C-c C-j" . consult-dir-jump-file)
   )
  :config
  (setq consult-dir-default-command 'consult-find)
  )
;; consult:3 ends here

;; [[file:../package.org::*consult][consult:5]]
(use-package consult-yasnippet
  :ensure nil
  ;; :defer t
  ;; :demand t
  :after (consult yasnippet)
  )
;; consult:5 ends here
