package.org
* minibuffer
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       ACE87324-3F5F-49FC-B886-1FE7B1EB58C7
:END:

** marginalia

#+begin_src emacs-lisp
;; marginalia: minibuffer annotations
;; {{{
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  :ensure nil
  ;; Either bind `marginalia-cycle' globally or only in the minibuffer
  ;; :bind (("C-M-a" . marginalia-cycle)
  ;;        :map minibuffer-local-map
  ;;        ("C-M-a" . marginalia-cycle))
  ;; :custom (marginalia-align 'right)
  ;; :init
  ;; The :init configuration is always executed (Not lazy!)
  ;; Must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  ;; (marginalia-mode)
  :hook (after-init . marginalia-mode)
  :config
  ;; https://emacs-china.org/t/21-emacs-vertico-orderless-marginalia-embark-consult/19683/
  (defun marginalia-annotate-command (cand)
    "Annotate command CAND with its documentation string.
Similar to `marginalia-annotate-symbol', but does not show symbol class."
    (when-let* ((sym (intern-soft cand))
                (mode (if (boundp sym)
                          sym
                        (lookup-minor-mode-from-indicator cand))))
      (concat
       (if (and (boundp mode) (symbol-value mode))
           (propertize " On" 'face 'marginalia-on)
         (propertize " Off" 'face 'marginalia-off))
       (marginalia-annotate-binding cand)
       (marginalia--documentation (marginalia--function-doc sym)))))
  )
;; }}}
#+end_src

** vertico+posframe

#+begin_src emacs-lisp
(use-package vertico
  :ensure nil
  :bind
  (
   :map vertico-map
   ([backtab] . vertico-previous)
   ("<tab>" . vertico-insert)    ; Choose selected candidate
   ;; ("<escape>" . minibuffer-keyboard-quit) ; Close minibuffer
   ("<escape>" . vertico-exit)
   :map minibuffer-local-map
   ("M-h" . backward-kill-word)
   )
  :init
  (fido-mode -1)
  (fido-vertical-mode -1)
  (vertico-mode)
  (vertico-mouse-mode)
  ;; (setq vertico-scroll-margin 0) ; Different scroll margin
  (setq vertico-count 20)  ; Show more candidates
  (setq vertico-resize nil) ; Grow and shrink the Vertico minibuffer
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (setq vertico-cycle t)
  )
#+end_src

#+begin_src emacs-lisp :tangle no
;; Configure directory extension.
(use-package vertico-directory
  :ensure nil
  :after vertico
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy)
  ;; More convenient directory navigation commands
  :bind
  (
   :map vertico-map
   ("H-k" . vertico-directory-up)
   ("RET" . vertico-directory-enter)
   ("DEL" . vertico-directory-delete-char)
   ("M-DEL" . vertico-directory-delete-word)
   )
  )
#+end_src

#+begin_src emacs-lisp
;; A few more useful configurations...
(use-package emacs
  :ensure nil
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t)
  )
#+end_src

#+begin_src emacs-lisp
(use-package vertico-posframe
  :ensure nil
  :after (vertico posframe)
  :config
  (vertico-multiform-mode 1)
  ;; (setq vertico-multiform-commands
  ;;       '((consult-line
  ;;          posframe
  ;;          (vertico-posframe-poshandler . posframe-poshandler-frame-top-center)
  ;;          (vertico-posframe-border-width . 10)
  ;;          ;; NOTE: This is useful when emacs is used in both in X and
  ;;          ;; terminal, for posframe do not work well in terminal, so
  ;;          ;; vertico-buffer-mode will be used as fallback at the
  ;;          ;; moment.
  ;;          (vertico-posframe-fallback-mode . vertico-buffer-mode))
  ;;         (t posframe)))

  (vertico-posframe-mode 1)
  (setq vertico-posframe-parameters
        '(
          (left-fringe . 20)
          (right-fringe . 20)
          ))
  )
#+end_src

#+begin_src emacs-lisp :tangle no
(defun with-minibuffer-keymap (keymap)
  (lambda (fn &rest args)
    (minibuffer-with-setup-hook
        (lambda ()
          (use-local-map
           (make-composed-keymap keymap (current-local-map))))
      (apply fn args))))

(defvar embark-completing-read-prompter-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "<tab>") 'abort-recursive-edit)
    map))

(advice-add 'embark-completing-read-prompter :around
            (with-minibuffer-keymap embark-completing-read-prompter-map))
(define-key vertico-map (kbd "<tab>") 'embark-act-with-completing-read)

(defun embark-act-with-completing-read (&optional arg)
  (interactive "P")
  (let* ((embark-prompter 'embark-completing-read-prompter)
         (act (propertize "Act" 'face 'highlight))
         (embark-indicator (lambda (_keymap targets) nil)))
    (embark-act arg)))
#+end_src

** aggressive-completion

#+begin_src emacs-lisp :tangle no
(use-package aggressive-completion
  :straight t
  :bind
  (:map aggressive-completion-minibuffer-map
        ("TAB" . completion:auto-select))
  :hook
  (after-init-hook . aggressive-completion-mode)
  :config
  (add-hook 'aggressive-completion-mode-hook #'completion:disable-auto-select)
  (defun completion:disable-auto-select ()
    ;; 避免自动切换至 `Completions-buffer' 中的补全项
    (setq completion-auto-select nil
          ;; 禁止 `minibuffer' 中的补全
          completion-cycle-threshold nil))

  (defun completion:auto-select ()
    "`TAB' 键可切换至 `Completions-buffer' 中的补全项"
    (interactive)
    (let ((completion-auto-select t))
      (minibuffer-complete))))
#+end_src

#+begin_src emacs-lisp :tangle no
;; minibuffer + aggressive-completion
;; https://emacs-china.org/t/helm-ivy-selectrum-completions-buffer/17148/44
;; {{{
(use-package minibuffer
  :init
  (keymap-unset minibuffer-local-completion-map "SPC")
  :bind
  (:map completion-list-mode-map
        ("z" . switch-to-minibuffer))
  :custom
  (isearch-allow-scroll t)
  ;; (enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode t)
  (minibuffer-electric-default-mode t)
  ;; Don't insert completion at point into minibuffer
  (minibuffer-completion-auto-choose nil)
  ;; One frame one minibuffer.
  (minibuffer-follows-selected-frame nil)
  (read-buffer-completion-ignore-case t)
  (read-file-name-completion-ignore-case t)
  (minibuffer-default-prompt-format " [%s]")
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt))
  (resize-mini-windows t)
  (completion-auto-help t)
  (completion-show-help nil)
                                        ;(completion-show-inline-help nil)
  (completion-cycle-threshold nil)
  ;; `t' `second-tab' `nil'
  (completion-auto-select 'seond-tab)
  (completions-detailed t)
  ;; Ignore cases when complete
  (completion-ignore-case t)
  ;; vertical display
  (completions-format 'one-column)
  (completions-max-height 7)
  (completions-sort #'completion:list-sort)
  :config
  ;; Hide the mode line of the Completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Completions\\*"
                 nil
                 (window-parameters (mode-line-format . none))))

  (defun completion:list-sort (all)
    "对 `Completions-buffer' 中的补全项进行排序"
    (let ((hist (minibuffer-history-value)))
      (thread-first all
                    (sort (lambda (c1 c2) (< (length c1) (length c2))))
                    (sort (lambda (c1 c2) (> (length (member c1 hist))
                                             (length (member c2 hist)))))))))
;; }}}
#+end_src

* tree-sitter
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       84F714FD-7024-4C24-8065-5338BEAFA376
:END:

** treesit-auto

#+begin_src emacs-lisp :tangle no
(use-package treesit-auto
  :config
  (global-treesit-auto-mode))
#+end_src

* 补全 & LSP
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       B7CF8CED-3844-4A68-B89F-A9E7294AD72C
:END:

** corfu+cape

https://www.youtube.com/watch?v=Vx0bSKF4y78

#+begin_src emacs-lisp :tangle no
(use-package corfu
  :ensure t
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-quit-at-boundary nil)
  (corfu-scroll-margin 5)
  (corfu-echo-documentation t)
  (corfu-quit-no-match t)
  :bind
  (
   :map corfu-map
   ("TAB" . corfu-insert)
   ([tab] . corfu-insert)
   ("C-n" . corfu-next)
   ("C-p" . corfu-previous)
   )
  :init (global-corfu-mode))

(use-package corfu-popupinfo
  :after corfu
  :ensure nil
  :init
  (corfu-popupinfo-mode)
  :config
  (setq corfu-popupinfo-delay 0.1)
  )

;; https://codeberg.org/akib/emacs-corfu-terminal

;; https://github.com/manateelazycat/corfu-english-helper
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package cape
  :ensure t
  :config
  (defun granddaifuku/eglot-capf ()
    (setq-local completion-at-point-functions
                (list
                 (cape-super-capf
                  #'eglot-completion-at-point
                  (cape-company-to-capf #'company-yasnippet)))))
  (add-hook 'eglot-managed-mode-hook #'granddaifuku/eglot-capf)
  )

;; cape-yasnippet
#+end_src

#+begin_src emacs-lisp :tangle no
;; https://github.com/granddaifuku/.emacs.d

;; for company
(add-hook
 'eglot-managed-mode-hook
 (lambda ()
   (add-to-list 'company-backends '(company-capf :with company-yasnippet))))

;; for corfu
(use-package cape)

(defun my/eglot-capf ()
  (setq-local completion-at-point-functions
              (list
               (cape-super-capf
                #'eglot-completion-at-point
                (cape-company-to-capf #'company-yasnippet)))))

(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
#+end_src

** company

company-box

company-quickhelp

** lsp-bridge :FIXME:Git:

