site-lisp/my-package.el

;; [[file:../package.org::*marginalia][marginalia:1]]
;; marginalia: minibuffer annotations
;; {{{
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  :ensure nil
  ;; Either bind `marginalia-cycle' globally or only in the minibuffer
  ;; :bind (("C-M-a" . marginalia-cycle)
  ;;        :map minibuffer-local-map
  ;;        ("C-M-a" . marginalia-cycle))
  ;; :custom (marginalia-align 'right)
  ;; :init
  ;; The :init configuration is always executed (Not lazy!)
  ;; Must be in the :init section of use-package such that the mode gets
  ;; enabled right away. Note that this forces loading the package.
  ;; (marginalia-mode)
  :hook (after-init . marginalia-mode)
  :config
  ;; https://emacs-china.org/t/21-emacs-vertico-orderless-marginalia-embark-consult/19683/
  (defun marginalia-annotate-command (cand)
    "Annotate command CAND with its documentation string.
Similar to `marginalia-annotate-symbol', but does not show symbol class."
    (when-let* ((sym (intern-soft cand))
                (mode (if (boundp sym)
                          sym
                        (lookup-minor-mode-from-indicator cand))))
      (concat
       (if (and (boundp mode) (symbol-value mode))
           (propertize " On" 'face 'marginalia-on)
         (propertize " Off" 'face 'marginalia-off))
       (marginalia-annotate-binding cand)
       (marginalia--documentation (marginalia--function-doc sym)))))
  )
;; }}}
;; marginalia:1 ends here

;; [[file:../package.org::*vertico+posframe][vertico+posframe:1]]
(use-package vertico
  :ensure nil
  :bind
  (
   :map vertico-map
   ([backtab] . vertico-previous)
   ("<tab>" . vertico-insert)    ; Choose selected candidate
   ;; ("<escape>" . minibuffer-keyboard-quit) ; Close minibuffer
   ("<escape>" . vertico-exit)
   :map minibuffer-local-map
   ("M-h" . backward-kill-word)
   )
  :init
  (fido-mode -1)
  (fido-vertical-mode -1)
  (vertico-mode)
  (vertico-mouse-mode)
  ;; (setq vertico-scroll-margin 0) ; Different scroll margin
  (setq vertico-count 20)  ; Show more candidates
  (setq vertico-resize nil) ; Grow and shrink the Vertico minibuffer
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (setq vertico-cycle t)
  )
;; vertico+posframe:1 ends here

;; [[file:../package.org::*vertico+posframe][vertico+posframe:3]]
;; A few more useful configurations...
(use-package emacs
  :ensure nil
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t)
  )
;; vertico+posframe:3 ends here

;; [[file:../package.org::*vertico+posframe][vertico+posframe:4]]
(use-package vertico-posframe
  :ensure nil
  :after (vertico posframe)
  :config
  (vertico-multiform-mode 1)
  ;; (setq vertico-multiform-commands
  ;;       '((consult-line
  ;;          posframe
  ;;          (vertico-posframe-poshandler . posframe-poshandler-frame-top-center)
  ;;          (vertico-posframe-border-width . 10)
  ;;          ;; NOTE: This is useful when emacs is used in both in X and
  ;;          ;; terminal, for posframe do not work well in terminal, so
  ;;          ;; vertico-buffer-mode will be used as fallback at the
  ;;          ;; moment.
  ;;          (vertico-posframe-fallback-mode . vertico-buffer-mode))
  ;;         (t posframe)))

  (vertico-posframe-mode 1)
  (setq vertico-posframe-parameters
        '(
          (left-fringe . 20)
          (right-fringe . 20)
          ))
  )
;; vertico+posframe:4 ends here

;; [[file:../package.org::*YASnippet][YASnippet:1]]
;; yasnippet
;; {{{
