package.org
*** use-package

#+begin_src emacs-lisp :tangle no
(use-package lsp-bridge
  :ensure nil
  ;; :after (yasnippet posframe)
  ;; :hook
  ;; (after-init . lsp-bridge-mode)
  ;; ((prog-mode org-mode) . lsp-bridge-mode)
  :defer 1
  ;; :commands lsp-bridge-mode
  :bind
  (
   :map acm-mode-map
   ;; ("RET" . nil)
   ;; ("<escape>"  . acm-hide)
   ;; insert common/abort completion
   ("<escape>"  . acm-insert-common)
   ("C-j"       . acm-insert-common)
   ;; ("RET"       . acm-insert-common)
   ;; complete
   ("SPC"       . acm-complete)
   ;; ("RET"       . acm-complete)
   ;; ([remap yas-expand] . acm-complete)
   ;; select
   ("TAB"       . acm-select-next)
   ("<tab>"       . acm-select-next)
   ("<backtab>" . acm-select-prev)
   ;; ("H-TAB"    . acm-select-prev)
   ("H-j"       . acm-select-next)
   ("H-k"      . acm-select-prev)
   ;; :map lsp-bridge-mode-map
   ;; ("M-." . lsp-bridge-find-def)
   ;; ("M-," . lsp-bridge-return-from-def)
   ;; ("M-?" . lsp-bridge-find-references)
   ;; ("M-i" . lsp-bridge-lookup-documentation)
   ;; ("M-n" . lsp-bridge-popup-documentation-scroll-up)
   ;; ("M-p" . lsp-bridge-popup-documentation-scroll-down)
   ;; ("s-C-n" . lsp-bridge-jump-to-next-diagnostic)
   ;; ("s-C-p" . lsp-bridge-jump-to-prev-diagnostic)
   )
  :init
  (setq-default lsp-bridge-enable-mode-line nil)
  :config
  (require 'yasnippet)
  (yas-global-mode 1)
  (require 'lsp-bridge)
  (global-lsp-bridge-mode)
  (setq acm-enable-quick-access t)
  (setq acm-quick-access-modifier 'meta)
  ;; (setq lsp-bridge-auto-format-code t)
  ;; (setq lsp-bridge-python-lsp-server "jedi")
  ;; (setq lsp-bridge-use-ds-pinyin-in-org-mode t)
  ;; (setq lsp-bridge-use-wenls-in-org-mode t)
  ;; ;; lsp-bridge-org-babel-lang-list ; default: clojure latex python
  ;; (add-to-list 'lsp-bridge-org-babel-lang-list "emacs-lisp")
  ;; (add-to-list 'lsp-bridge-org-babel-lang-list "shell")
  )
#+end_src

*** vanilla

#+begin_src emacs-lisp :tangle no
(require 'yasnippet)
(yas-global-mode 1)
(require 'lsp-bridge)
(global-lsp-bridge-mode)
;; (keymap-set acm-mode-map "ESC"       'acm-hide)   ; FIXME
(keymap-unset acm-mode-map "SPC")
(keymap-unset acm-mode-map "RET")
(keymap-unset acm-mode-map "TAB")
(keymap-unset acm-mode-map "<tab>")
;; complete
(keymap-set acm-mode-map "SPC" 'acm-complete)
;; (keymap-set acm-mode-map "RET" 'acm-complete)
;; select 方案一
(keymap-set acm-mode-map "TAB" 'acm-select-next)
(keymap-set acm-mode-map "<backtab>" 'acm-select-prev)
;; (keymap-set acm-mode-map "H-TAB"       'acm-select-next)
;; select 方案二
(keymap-set acm-mode-map "H-j" 'acm-select-next)
(keymap-set acm-mode-map "H-k" 'acm-select-prev)
;; select 方案三
;; (keymap-set acm-mode-map "RET"     'acm-select-next)
;; (keymap-set acm-mode-map "<tab>"     'acm-select-prev)
;; abort
(keymap-set acm-mode-map "C-j" 'acm-insert-common)
;; hide
(keymap-set acm-mode-map "<escape>" 'acm-hide)
#+end_src

*** idle

#+begin_src emacs-lisp :tangle no
(run-with-idle-timer
 1 nil
 #'(lambda ()
     (require 'yasnippet)
     (yas-global-mode 1)
     (require 'lsp-bridge)
     (global-lsp-bridge-mode)
     ;; (keymap-set acm-mode-map "ESC"       'acm-hide)   ; FIXME
     (keymap-unset acm-mode-map "SPC")
     (keymap-unset acm-mode-map "RET")
     (keymap-unset acm-mode-map "TAB")
     (keymap-unset acm-mode-map "<tab>")
     ;; complete
     (keymap-set acm-mode-map "SPC" 'acm-complete)
     (keymap-set acm-mode-map "RET" 'acm-complete)
     ;; select 方案一
     (keymap-set acm-mode-map "TAB" 'acm-select-next)
     (keymap-set acm-mode-map "<backtab>" 'acm-select-prev)
     ;; (keymap-set acm-mode-map "H-TAB"       'acm-select-next)
     ;; select 方案二
     (keymap-set acm-mode-map "H-j" 'acm-select-next)
     (keymap-set acm-mode-map "H-k" 'acm-select-prev)
     ;; select 方案三
     ;; (keymap-set acm-mode-map "RET"     'acm-select-next)
     ;; (keymap-set acm-mode-map "<tab>"     'acm-select-prev)
     ;; abort
     (keymap-set acm-mode-map "C-j" 'acm-insert-common)
     ;; hide
     (keymap-set acm-mode-map "<escape>" 'acm-hide)
     ))
#+end_src

*** misc

#+begin_src emacs-lisp :tangle no
(setq lsp-bridge-default-mode-hooks
      (remove 'org-mode-hook lsp-bridge-default-mode-hooks))
#+end_src

#+begin_src emacs-lisp :tangle no
;; (keymap-set acm-mode-map "H-;" 'lsp-bridge-toggle-sdcv-helper)
;; (define-key map [remap next-line] #'acm-select-next)
;; (define-key map [remap previous-line] #'acm-select-prev)
;; (define-key map [down] #'acm-select-next)
;; (define-key map [up] #'acm-select-prev)
;; (define-key map [tab]  #'acm-complete)
;; (define-key map "\M-n" #'acm-select-next)
;; (define-key map "\M-p" #'acm-select-prev)
;; (define-key map "\M-," #'acm-select-last)
;; (define-key map "\M-." #'acm-select-first)
;; (define-key map "\C-m" #'acm-complete)
;; (define-key map "\t" #'acm-complete)
;; (define-key map "\n" #'acm-complete)
;; (define-key map "\M-h" #'acm-complete)
;; (define-key map "\M-H" #'acm-insert-common)
;; (define-key map "\M-u" #'acm-filter)
;; (define-key map "\M-d" #'acm-doc-toggle)
;; (define-key map "\M-j" #'acm-doc-scroll-up)
;; (define-key map "\M-k" #'acm-doc-scroll-down)
;; (define-key map "\M-l" #'acm-hide)
;; (define-key map "\C-g" #'acm-hide)
#+end_src

* snippet
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       AA2CF138-2651-49C1-A005-B1B7B7363A69
:END:

** YASnippet

#+begin_src emacs-lisp
;; yasnippet
;; {{{
(use-package yasnippet
  :ensure nil
  ;; :diminish yas-minor-mode
  :hook
  (after-init . yas-reload-all)
  ;; ((prog-mode LaTeX-mode org-mode) . yas-minor-mode)
  :config
  (yas-global-mode 1)
  ;; Suppress warning for yasnippet code.
  (require 'warnings)
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change))

  ;; (setq yas-prompt-functions '(yas-x-prompt yas-dropdown-prompt))

  ;; (defun smarter-yas-expand-next-field ()
  ;;   "Try to `yas-expand' then `yas-next-field' at current cursor position."
  ;;   (interactive)
  ;;   (let ((old-point (point))
  ;;         (old-tick (buffer-chars-modified-tick)))
  ;;     (yas-expand)
  ;;     (when (and (eq old-point (point))
  ;;                (eq old-tick (buffer-chars-modified-tick)))
  ;;       (ignore-errors (yas-next-field))))
  ;;   )
  )
;; }}}
#+end_src

** yankpad

#+begin_src emacs-lisp :tangle no
(use-package yankpad
  :ensure t
  ;; :defer 10
  :init
  (setq yankpad-file (concat user-emacs-directory "yankpad.org"))
  :bind (:map my-map ("SPC" . yankpad-insert)
              ("y" . yankpad-expand)
              )
  :config
  (bind-key "<f7>" 'yankpad-map)
  (bind-key "<f12>" 'yankpad-expand)
  ;; If you want to complete snippets using company-mode
  (add-to-list 'company-backends #'company-yankpad)
  ;; If you want to expand snippets with hippie-expand
  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand))
#+end_src

** Tempel

* 中文：拼音输入与搜索
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       82FC09E4-AC1A-4AE0-82D7-1145D1CA45AB
:END:

** pyim                                                              :输入法:

*** 基础设置

#+begin_src emacs-lisp
;; pyim
;; {{{
(use-package pyim
  :ensure nil
  :defer 1
  :bind
  (
   ("H-e" . toggle-input-method)
   ([remap backward-word] . pyim-backward-word)
   ([remap forward-word]  . pyim-forward-word)
   ;; ("H-b" . pyim-backward-word)
   ;; ("H-f" . pyim-forward-word)
   ("H-c H-c" . pyim-convert-string-at-point) ; 金手指：将字符串转换为中文。
   :map minibuffer-local-map
   ("H-c" . pyim-cregexp-convert-at-point) ; 将光标前字符转换为搜索中文的 regexp.
   :map pyim-mode-map
   ("-"   . pyim-page-previous-page)
   ("+"   . pyim-page-next-page)
   ("H-h" . pyim-page-previous-page)
   ("H-l" . pyim-page-next-page)
   ("H-j" .  pyim-forward-imelem)
   ("H-k" . pyim-backward-imelem)
   )
  :init
  ;; (setq default-input-method "pyim")
  (setq pyim-default-scheme 'quanpin) ; shaungpin/rime
  ;; (setq default-input-method "pyim")
  (setq pyim-page-style 'vertical)
  (setq pyim-page-tooltip '(posframe minibuffer popup))
  (setq pyim-page-length 9)
  :config
  (require 'pyim-cregexp-utils)
  (require 'pyim-cstring-utils)

  ;; (require 'pyim-basedict) ; 拼音词库设置
  ;; (pyim-basedict-enable)   ; 拼音词库
  ;; (require 'pyim-greatdict)
  ;; (pyim-greatdict-enable)
  (require 'pyim-tsinghua-dict)
  (pyim-tsinghua-dict-enable)

  (setq-default pyim-punctuation-translate-p '(auto)) ;; 全角半角

  ;; 让 avy 支持拼音搜索
  (with-eval-after-load 'avy
    (defun my-avy--regex-candidates (fun regex &optional beg end pred group)
      (let ((regex (pyim-cregexp-build regex)))
        (funcall fun regex beg end pred group)))
    (advice-add 'avy--regex-candidates :around #'my-avy--regex-candidates))

  ;; 让 vertico, selectrum 等补全框架，通过 orderless 支持拼音搜索候选项功能。
  (defun my-orderless-regexp (orig-func component)
    (let ((result (funcall orig-func component)))
      (pyim-cregexp-build result)))

  (advice-add 'orderless-regexp :around #'my-orderless-regexp)

  (pyim-isearch-mode -1) ; 性能差，不启用
  )
;; }}}
#+end_src

*** 光标颜色

#+begin_src emacs-lisp :tangle no
(use-package pyim
  :ensure nil
  :config
  (setq pyim-indicator-list
        (list
         #'my-pyim-indicator-with-cursor-color #'pyim-indicator-with-modeline))

  (defun my-pyim-indicator-with-cursor-color (input-method chinese-input-p)
    (if (not (equal input-method "pyim"))
        (progn
          ;; 用户在这里定义 pyim 未激活时的光标颜色设置语句
          (set-cursor-color "grey"))
      (if chinese-input-p
          (progn
            ;; 用户在这里定义 pyim 输入中文时的光标颜色设置语句
            (set-cursor-color "purple"))
        ;; 用户在这里定义 pyim 输入英文时的光标颜色设置语句
        (set-cursor-color "green"))))
  )
#+end_src

*** 输入法切换探针

#+begin_src emacs-lisp
(use-package pyim
  :ensure nil
  :config
  ;; 探针
  (setq-default pyim-english-input-switch-functions
                '(pyim-probe-auto-english
                  pyim-probe-program-mode
                  pyim-probe-dynamic-english
                  pyim-probe-isearch-mode
                  pyim-probe-org-structure-template
                  pyim-probe-org-speed-commands))

  (setq-default pyim-punctuation-half-width-functions
                '(pyim-probe-punctuation-line-beginning
                  pyim-probe-punctuation-after-punctuation))
  )
#+end_src

** pinyinlib

#+begin_src emacs-lisp
(use-package pinyinlib
  :ensure nil
  :defer t
  )
#+end_src

竞品：pyim

** ace-pinyin

#+begin_src emacs-lisp
;; ace-pinyin
;; {{{
(use-package ace-pinyin
  :defer 1
  :config
  (setq ace-pinyin-use-avy t)
  (ace-pinyin-global-mode +1)
  )
;; }}}
#+end_src

** emacs-rime

#+begin_src emacs-lisp :tangle no
(defun change-cursor-color-on-input-method ()
  "Set cursor color depending on whether an input method is used or not."
  (interactive)
  (set-cursor-color (if (and (rime--should-enable-p)
                             (not (rime--should-inline-ascii-p))
                             current-input-method)
                        input-method-cursor-color
                      default-cursor-color)))
#+end_src

[[https://github.com/DogLooksGood/emacs-rime][DogLooksGood/emacs-rime: RIME ㄓ in Emacs]]

[[https://github.com/Eason0210/im-cursor-chg][Eason0210/im-cursor-chg]]

* 搜索工具
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       61B1EF66-4E1B-4A45-AEB7-07F5A30FC68E
:END:

