package.org
** orderless

#+begin_src emacs-lisp
;; orderless: minibuffer filter, works with icomplete
;; {{{
(use-package orderless
  :ensure nil
  :init
  ;; basic partial-completion emacs22 substring initials flex
  (setq completion-styles '(basic partial-completion orderless))
  ;; (setq completion-styles
  ;;       '(orderless basic initials substring partial-completion flex)
  (setq completion-category-defaults nil)
  (setq completion-category-overrides nil)
  ;; (setq completion-category-overrides
  ;;       '((file
  ;;          (styles basic partial-completion)
  ;;          )))
  (setq orderless-component-separator "[ &]") ; & is for company because space will break completion
  ;; :config
  ;; ;; make completion support pinyin, refer to
  ;; ;; https://emacs-china.org/t/vertico/17913/2
  ;; ;; list 版
  ;; (defun completion--regex-pinyin (str)
  ;;   (orderless-regexp (pinyinlib-build-regexp-string str))
  ;;   )
  ;; (add-to-list 'orderless-matching-styles 'completion--regex-pinyin)
  ;; ;; advice 版
  ;; (defun orderless-regexp-pinyin (str)
  ;;   (setf (car str) (pinyinlib-build-regexp-string (car str)))
  ;;   str)
  ;; (advice-add 'orderless-regexp :filter-args #'orderless-regexp-pinyin)

  ;; https://emacs-china.org/t/consult-ripgrep/23237/9
  (defun without-if-bang (pattern _index _total)
    (cond
     ((equal "!" pattern)
      '(orderless-literal . ""))
     ((string-prefix-p "!" pattern)
      `(orderless-without-literal . ,(substring pattern 1)))))
  :config
  (add-to-list 'orderless-style-dispatchers #'without-if-bang)
  )
;; }}}
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package
  orderless
  :config
  (defmacro dispatch: (regexp style)
    (cl-flet
        ((symcat (a b) (intern (concat a (symbol-name b)))))
      `(defun ,(symcat "dispatch:" style) (pattern _index _total)
         (when (string-match ,regexp pattern)
           (cons ',(symcat "orderless-" style) (match-string 1 pattern))))))
  (cl-flet
      ((pre/post (str) (format "^%s\\(.*\\)$\\|^\\(?1:.*\\)%s$" str str)))
    (dispatch: (pre/post "=") literal)
    (dispatch: (pre/post "`") regexp)
    (dispatch:
     (pre/post
      (if (or minibuffer-completing-file-name (derived-mode-p 'eshell-mode))
          "%"
        "[%.]"))
     initialism))
  (dispatch: "^{\\(.*\\)}$" flex)
  (dispatch: "^\\([^][^\\+*]*[./-][^][\\+*$]*\\)$" prefixes)
  (dispatch: "^!\\(.+\\)$" without-literal)

  (orderless-define-completion-style
      +orderless-with-initialism
    (orderless-matching-styles
     '(orderless-initialism orderless-literal orderless-regexp)))
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides
   '((file (styles partial-completion))
     (command (styles +orderless-with-initialism))
     (variable (styles +orderless-with-initialism))
     (symbol (styles +orderless-with-initialism))
     (eglot (styles +orderless-with-initialism))))
  (orderless-style-dispatchers
   '(dispatch:literal
     dispatch:regexp
     dispatch:without-literal
     dispatch:initialism
     dispatch:flex
     dispatch:prefixes))
  (orderless-component-separator #'orderless-escapable-split-on-space))
#+end_src

** isearch-mb

[[https://github.com/astoff/isearch-mb][astoff/isearch-mb]]

[[https://emacs-china.org/t/isearch-mb-minibuffer-isearch-query/17878][isearch-mb: 在 minibuffer 中编辑 isearch query - Emacs China]]

** wgrep

#+begin_src emacs-lisp
(use-package wgrep
  :ensure nil
  :bind
  (
   :map grep-mode-map
   ("C-c C-q" . wgrep-change-to-wgrep-mode)
   )
  :config
  (setq wgrep-auto-save-buffer t)
  )
#+end_src

** ripgrep: deadgrep

#+begin_src emacs-lisp
;; deadgrep
;; {{{
(use-package deadgrep
  :ensure nil
  ;; :defer 1.5
  :bind
  (
   ("C-c d g" . deadgrep)
   ("C-c g o"   . my/grep-org-files)
   :map deadgrep-mode-map
   ("e" . deadgrep-edit-mode)
   :map deadgrep-edit-mode-map ; wgrep
   ("C-c C-c" . deadgrep-mode)
   )
  :config
  (setq deadgrep-max-buffers 1)
  (setq kill-buffer-query-functions nil)

  (defun my/grep-org-files (words)
    (interactive "sSearch(ripgrep) org-roam files: ")
    (let ((default-directory org-roam-directory)
          (deadgrep--file-type '(glob . "*.org"))
          (deadgrep--context '(1 . 1))
          (deadgrep--search-type 'regexp))
      (deadgrep words)
      )
    )

  (setq my/home-directory "~/")
  (defun my/deadgrep-home-dir ()
    (interactive)
    (if (equal major-mode 'dired-mode)
        (setq search-term
              (read-from-minibuffer "Search : "))
      (setq search-term
            (read-from-minibuffer "Search : " (thing-at-point 'symbol)))
      )
    (deadgrep search-term my/home-directory)
    )

  (defun my/deadgrep ()
    (interactive)
    (if (equal major-mode 'dired-mode)
        (setq search-term
              (read-from-minibuffer "Search : "))
      (setq search-term
            (read-from-minibuffer "Search : " (thing-at-point 'symbol)))
      )
    (deadgrep search-term)
    )
  )
;; }}}
#+end_src

** khoj

Natural Language Search

#+begin_src emacs-lisp :tangle no
;; khoj
;; {{{
;; Install Khoj Package from MELPA Stable
(use-package khoj
  :ensure nil
  :defer t
  :bind ("C-c n l" . 'khoj))
;; }}}
#+end_src

** color-rg :Git:

#+begin_src emacs-lisp :tangle no
(use-package color-rg
  ;; git@github.com:manateelazycat/color-rg.git
  :ensure nil
  :bind
  (
   :map isearch-mode-map
   ("M-s M-s" . isearch-toggle-color-rg)
   )
  )
#+end_src

* 文件管理
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       D49C1FE4-58E7-49DA-A075-48EA626A51D2
:END:

** dired-hacks

https://github.com/Fuco1/dired-hacks

** dired-recent

** dired-narrow

** dired-isearch

** ebib

#+begin_src emacs-lisp :tangle no
;; https://github.com/tshu-w/.emacs.d/blob/master/lisp/lang-latex.el
(use-package ebib
  :ensure nil
  :defer t
  :bind
  (
   :map ebib-multiline-mode-map
   ("C-c C-c" . ebib-quit-multiline-buffer-and-save)
   ("C-c C-q" . ebib-cancel-multiline-buffer)
   ("C-c C-s" . ebib-save-from-multiline-buffer)
   )
  :custom
  (bibtex-autokey-name-case-convert-function 'capitalize)
  (bibtex-autokey-titlewords 0)
  (bibtex-autokey-year-length 4)
  (ebib-uniquify-keys t)
  (ebib-bibtex-dialect 'biblatex)
  (ebib-index-window-size 10)
  (ebib-preload-bib-files '("~/Documents/Bibliography/references.bib"))
  (ebib-notes-use-single-file "~/Documents/Bibliography/Notes.org")
  (ebib-file-search-dirs '("~/Documents/Bibliography/bibtex-pdfs/"))
  (ebib-reading-list-file "~/Documents/Bibliography/ReadingList.org")
  (ebib-keywords-file "~/Documents/Bibliography/ebib-keywords.txt")
  (ebib-keywords-field-keep-sorted t)
  (ebib-keywords-file-save-on-exit 'always)
  (ebib-file-associations '(("pdf")) "using Emacs to open pdf")
  (ebib-use-timestamp t "recording the time that entries are added")
  (ebib-index-columns
   '(
     ("Entry Key" 20 t)
     ("Author/Editor" 40 nil)
     ("Year" 6 t)
     ("Title" 50 t)
     ))
  (ebib-index-default-sort '("timestamp" . descend))
  )
#+end_src

** bibtex-completion

#+begin_src emacs-lisp :tangle no
;; https://github.com/jousimies/.emacs.d/blob/master/lisp/init-bibtex.el
(use-package bibtex-completion
  :ensure nil
  :config
  (setq bibtex-completion-bibliography
        `(,(concat my-galaxy "/bibtexs/References.bib")
          ,(expand-file-name "L.Calibre/calibre.bib" my-cloud)))
  (setq bibtex-completion-notes-path (expand-file-name "roam/ref" my-galaxy))
  (setq bibtex-completion-pdf-field "File")
  (setq bibtex-completion-additional-search-fields '(keywords journal booktitle))
  (setq bibtex-completion-pdf-symbol "P")
  (setq bibtex-completion-notes-symbol "N")
  (setq bibtex-completion-display-formats
        '(
          (article . "${=has-pdf=:1} ${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
          (inbook . "${=has-pdf=:1} ${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
          (incollection . "${=has-pdf=:1} ${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
          (inproceedings . "${=has-pdf=:1} ${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
          (t . "${=has-pdf=:1} ${=has-note=:1} ${year:4} ${author:36} ${title:*}")
          ))
  )
#+end_src

** citar

#+begin_src emacs-lisp :tangle no

#+end_src

** org-ref

#+begin_src emacs-lisp :tangle no
(use-package org-ref
  :ensure nil
  :defer t
  ;; :general
  ;; (z-spc-leader-def "r" 'org-ref-hydra/body)
  ;; :pretty-hydra
  ;; ((:color red :quit-key "q")
  ;;  ("Insert"
  ;;   (("i" org-ref-helm-insert-cite-link "citation key")
  ;;    ("r" org-ref-helm-insert-ref-link "ref link")
  ;;    ("l" org-ref-helm-insert-label-link "label link"))
  ;;   "Browse"
  ;;   (("b" helm-bibtex "bibtex")
  ;;    ("s" crossref-lookup "lookup"))
  ;;   "Add"
  ;;   (("a" crossref-add-bibtex-entry "new entry")
  ;;    ("d" doi-add-bibtex-entry "doi"))))
  :custom
  (bibtex-dialect 'biblatex)
  (org-ref-bibliography-notes "~/Dropbox/Bibliography/Notes.org")
  (org-ref-default-bibliography '("~/Dropbox/Bibliography/references.bib"))
  (org-ref-pdf-directory "~/Dropbox/Bibliography/bibtex-pdfs/")
  (org-ref-show-broken-links nil)
  (org-ref-default-ref-type "eqref")
  (org-ref-default-citation-link "citet")
  :config
  (require 'org-ref-citeproc)
  ;; (defun org-ref-grep-pdf (&optional _candidate)
  ;;   "Search pdf files of marked CANDIDATEs."
  ;;   (interactive)
  ;;   (let ((keys (helm-marked-candidates))
  ;;         (get-pdf-function org-ref-get-pdf-filename-function))
  ;;     (helm-do-pdfgrep-1
  ;;      (-remove (lambda (pdf)
  ;;                 (string= pdf ""))
  ;;               (mapcar (lambda (key)
  ;;                         (funcall get-pdf-function key))
  ;;                       keys))))
  ;;   )

  ;; (helm-add-action-to-source "Grep PDF" 'org-ref-grep-pdf helm-source-bibtex 1)

  ;; (setq helm-bibtex-map
  ;;       (let ((map (make-sparse-keymap)))
  ;;         (set-keymap-parent map helm-map)
  ;;         (define-key map (kbd "C-s") (lambda () (interactive)
  ;;                                       (helm-run-after-exit 'org-ref-grep-pdf)))
  ;;         map))
  ;; (push `(keymap . ,helm-bibtex-map) helm-source-bibtex)
  )
#+end_src

** calibredb

Calibre sucks !

#+begin_src emacs-lisp :tangle no
(use-package calibredb
  :ensure nil
  :defer t
  ;; :bind
  ;; (
  ;;  :map calibredb-show-mode-map
  ;;  ()
  ;;  :map calibredb-search-mode-map
  ;;  ()
  ;;  )
  :config
  ;; (setq sql-sqlite-program
  ;;       "/usr/bin/sqlite3")
  ;; (setq calibredb-program
  ;;       "/Applications/calibre.app/Contents/MacOS/calibredb")
  (setq calibredb-root-dir "~/Documents/Calibre")
  (setq calibredb-db-dir
        (expand-file-name "metadata.db" calibredb-root-dir))
  (setq calibredb-library-alist
        '(
          ("~/Documents/Calibre")
          ("~/Downloads/apps")
          ("~/Downloads/docs")
          ("~/Downloads/image")
          ("~/Downloads/audio")
          ("~/Downloads/video")
          ))
  (setq calibredb-virtual-library-alist
        '(
          ("1. Reading" . "Read \\(pdf\\|epub\\)")
          ;; ("2. Read it later" . "Readit epub")
          ;; ("3. Development - rust" . "rust")
          ))
  (setq calibredb-format-all-the-icons t)
  (setq calibredb-format-icons-in-terminal t)
  ;; (setq calibredb-format-character-icons t)
  (setq calibredb-fetch-metadata-source-list
        '("Amazon.com" "Douban Books" "Google"))
  ;; (setq calibredb-id-width 4)
  (setq calibredb-size-show t)
  )
#+end_src

