site-lisp/my-package.el

;; [[file:../package.org::*orderless][orderless:1]]
;; orderless: minibuffer filter, works with icomplete
;; {{{
(use-package orderless
  :ensure nil
  :init
  ;; basic partial-completion emacs22 substring initials flex
  (setq completion-styles '(basic partial-completion orderless))
  ;; (setq completion-styles
  ;;       '(orderless basic initials substring partial-completion flex)
  (setq completion-category-defaults nil)
  (setq completion-category-overrides nil)
  ;; (setq completion-category-overrides
  ;;       '((file
  ;;          (styles basic partial-completion)
  ;;          )))
  (setq orderless-component-separator "[ &]") ; & is for company because space will break completion
  ;; :config
  ;; ;; make completion support pinyin, refer to
  ;; ;; https://emacs-china.org/t/vertico/17913/2
  ;; ;; list 版
  ;; (defun completion--regex-pinyin (str)
  ;;   (orderless-regexp (pinyinlib-build-regexp-string str))
  ;;   )
  ;; (add-to-list 'orderless-matching-styles 'completion--regex-pinyin)
  ;; ;; advice 版
  ;; (defun orderless-regexp-pinyin (str)
  ;;   (setf (car str) (pinyinlib-build-regexp-string (car str)))
  ;;   str)
  ;; (advice-add 'orderless-regexp :filter-args #'orderless-regexp-pinyin)

  ;; https://emacs-china.org/t/consult-ripgrep/23237/9
  (defun without-if-bang (pattern _index _total)
    (cond
     ((equal "!" pattern)
      '(orderless-literal . ""))
     ((string-prefix-p "!" pattern)
      `(orderless-without-literal . ,(substring pattern 1)))))
  :config
  (add-to-list 'orderless-style-dispatchers #'without-if-bang)
  )
;; }}}
;; orderless:1 ends here

;; [[file:../package.org::*wgrep][wgrep:1]]
(use-package wgrep
  :ensure nil
  :bind
  (
   :map grep-mode-map
   ("C-c C-q" . wgrep-change-to-wgrep-mode)
   )
  :config
  (setq wgrep-auto-save-buffer t)
  )
;; wgrep:1 ends here

;; [[file:../package.org::*ripgrep: deadgrep][ripgrep: deadgrep:1]]
;; deadgrep
;; {{{
(use-package deadgrep
  :ensure nil
  ;; :defer 1.5
  :bind
  (
   ("C-c d g" . deadgrep)
   ("C-c g o"   . my/grep-org-files)
   :map deadgrep-mode-map
   ("e" . deadgrep-edit-mode)
   :map deadgrep-edit-mode-map ; wgrep
   ("C-c C-c" . deadgrep-mode)
   )
  :config
  (setq deadgrep-max-buffers 1)
  (setq kill-buffer-query-functions nil)

  (defun my/grep-org-files (words)
    (interactive "sSearch(ripgrep) org-roam files: ")
    (let ((default-directory org-roam-directory)
          (deadgrep--file-type '(glob . "*.org"))
          (deadgrep--context '(1 . 1))
          (deadgrep--search-type 'regexp))
      (deadgrep words)
      )
    )

  (setq my/home-directory "~/")
  (defun my/deadgrep-home-dir ()
    (interactive)
    (if (equal major-mode 'dired-mode)
        (setq search-term
              (read-from-minibuffer "Search : "))
      (setq search-term
            (read-from-minibuffer "Search : " (thing-at-point 'symbol)))
      )
    (deadgrep search-term my/home-directory)
    )

  (defun my/deadgrep ()
    (interactive)
    (if (equal major-mode 'dired-mode)
        (setq search-term
              (read-from-minibuffer "Search : "))
      (setq search-term
            (read-from-minibuffer "Search : " (thing-at-point 'symbol)))
      )
    (deadgrep search-term)
    )
  )
;; }}}
;; ripgrep: deadgrep:1 ends here
