package.org
* 版本管理: git: Magit
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       8262274A-F276-4FFE-8534-4DE23ED1F17D
:END:

[[https://emacs-china.org/t/magit-add-commit-push/22457][magit一键add, commit, push - Emacs China]]

#+begin_src emacs-lisp
;; difftastic + magit
;; {{{
;; (with-eval-after-load 'magit
(use-package magit
  ;; :defer 1
  :bind
  (
   ("C-x g"   . magit-status)
   ("C-c v g" . magit-status)
   ("H-m H-m" . magit-status)
   :map magit-status-mode-map
   ("#" . my/magit-aux-commands)
   )
  :custom
  (magit-diff-refine-hunk t)
  (magit-module-sections-nested nil)
  :config
  (defun my/magit--with-difftastic (buffer command)
    "Run COMMAND with GIT_EXTERNAL_DIFF=difft then show result in BUFFER."
    (let ((process-environment
           (cons (concat "GIT_EXTERNAL_DIFF=difft --width="
                         (number-to-string (frame-width)))
                 process-environment)))
      ;; Clear the result buffer (we might regenerate a diff, e.g., for
      ;; the current changes in our working directory).
      (with-current-buffer buffer
        (setq buffer-read-only nil)
        (erase-buffer))
      ;; Now spawn a process calling the git COMMAND.
      (make-process
       :name (buffer-name buffer)
       :buffer buffer
       :command command
       ;; Don't query for running processes when emacs is quit.
       :noquery t
       ;; Show the result buffer once the process has finished.
       :sentinel (lambda (proc event)
                   (when (eq (process-status proc) 'exit)
                     (with-current-buffer (process-buffer proc)
                       (goto-char (point-min))
                       (ansi-color-apply-on-region (point-min) (point-max))
                       (setq buffer-read-only t)
                       (view-mode)
                       (end-of-line)
                       ;; difftastic diffs are usually 2-column side-by-side,
                       ;; so ensure our window is wide enough.
                       (let ((width (current-column)))
                         (while (zerop (forward-line 1))
                           (end-of-line)
                           (setq width (max (current-column) width)))
                         ;; Add column size of fringes
                         (setq width (+ width
                                        (fringe-columns 'left)
                                        (fringe-columns 'right)))
                         (goto-char (point-min))
                         (pop-to-buffer
                          (current-buffer)
                          `(;; If the buffer is that wide that splitting the frame in
                            ;; two side-by-side windows would result in less than
                            ;; 80 columns left, ensure it's shown at the bottom.
                            ,(when (> 80 (- (frame-width) width))
                               #'display-buffer-at-bottom)
                            (window-width
                             . ,(min width (frame-width))))))))))))

  (defun my/magit-show-with-difftastic (rev)
    "Show the result of \"git show REV\" with GIT_EXTERNAL_DIFF=difft."
    (interactive
     (list (or
            ;; If REV is given, just use it.
            (when (boundp 'rev) rev)
            ;; If not invoked with prefix arg, try to guess the REV from
            ;; point's position.
            (and (not current-prefix-arg)
                 (or (magit-thing-at-point 'git-revision t)
                     (magit-branch-or-commit-at-point)))
            ;; Otherwise, query the user.
            (magit-read-branch-or-commit "Revision"))))
    (if (not rev)
        (error "No revision specified")
      (my/magit--with-difftastic
       (get-buffer-create (concat "*git show difftastic " rev "*"))
       (list "git" "--no-pager" "show" "--ext-diff" rev))))

  (defun my/magit-diff-with-difftastic (arg)
    "Show the result of \"git diff ARG\" with GIT_EXTERNAL_DIFF=difft."
    (interactive
     (list (or
            ;; If RANGE is given, just use it.
            (when (boundp 'range) range)
            ;; If prefix arg is given, query the user.
            (and current-prefix-arg
                 (magit-diff-read-range-or-commit "Range"))
            ;; Otherwise, auto-guess based on position of point, e.g., based on
            ;; if we are in the Staged or Unstaged section.
            (pcase (magit-diff--dwim)
              ('unmerged (error "unmerged is not yet implemented"))
              ('unstaged nil)
              ('staged "--cached")
              (`(stash . ,value) (error "stash is not yet implemented"))
              (`(commit . ,value) (format "%s^..%s" value value))
              ((and range (pred stringp)) range)
              (_ (magit-diff-read-range-or-commit "Range/Commit"))))))
    (let ((name (concat "*git diff difftastic"
                        (if arg (concat " " arg) "")
                        "*")))
      (my/magit--with-difftastic
       (get-buffer-create name)
       `("git" "--no-pager" "diff" "--ext-diff" ,@(when arg (list arg))))))

  (transient-define-prefix my/magit-aux-commands ()
    "My personal auxiliary magit commands."
    ["Auxiliary commands"
     ("d" "Difftastic Diff (dwim)" my/magit-diff-with-difftastic)
     ("s" "Difftastic Show" my/magit-show-with-difftastic)])

  (transient-append-suffix 'magit-dispatch "!"
    '("#" "My Magit Cmds" my/magit-aux-commands))
  )
;; }}}

;; ;; delta + magit + magit-delta
;; ;; {{{
;; ;; https://scripter.co/using-git-delta-with-magit/
;; (use-package magit-delta
;;  :hook (magit-mode . magit-delta-mode)
;;   )
;; (add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))
;; ;; }}}
#+end_src

git-auto-commit

[[https://emacs-china.org/t/magit-blame-git-commit/7025][用 magit-blame 反向追踪 git commit - Emacs China]]

* 文件对比/文本对比 Diff
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       A3638E98-F0B9-4304-AE07-B0DFEC70922B
:END:
** 文件对比 diff-lisp                                                  :Git:

#+begin_src emacs-lisp
(use-package diff-lisp
  :ensure nil
  :bind
  ("s-/" . diff-lisp-set-a-and-b)
  :config
  (defvar diff-lisp-set-a-and-b nil)
  (defun diff-lisp-set-a-and-b ()
    (interactive)
    (if (eq diff-lisp-set-a-and-b nil)
        (progn
          (diff-lisp-mark-selected-text-as-a)
          (setq diff-lisp-set-a-and-b t)
          )
      (progn
        (diff-lisp-diff-a-and-b)
        (setq diff-lisp-set-a-and-b nil)
        ))
    )
  )
#+end_src

* undo
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       88545EEC-9A57-40CD-AB8B-1623729B63F4
:END:

** vundo

#+begin_src emacs-lisp
(use-package vundo
 :ensure nil
 :bind
 (
  ("H-z" . vundo)
  :map vundo-mode-map
  ;;
  ("j" . vundo-forward) ; f
  ("k" . vundo-backward) ; b
  ;; ("j" . vundo-next)     ; n
  ;; ("k" . vundo-previous) ; p
  ("ESC" . vundo-quit) ("SPC" . vundo-confirm)
  ;; ("a"   . vundo-stem-root)
  ;; ("d"   . vundo--debug)
  ;; ("e"   . vundo-stem-end)
  ;; ("i"   . vundo--inspect)
  ;; ("q"   . vundo-quit)
  ))
#+end_src

* 书签 Bookmark 
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       32BD08DE-090F-4FC9-93DC-10A36723EA5E
:END:

binky-mode

#+begin_src emacs-lisp
;; binky-mode
;; {{{

;; }}}
#+end_src

* 剪贴板 kill-ring/clipboard
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       D92B0D57-EB04-43B7-86F9-50339674562E
:END:

#+begin_src emacs-lisp :tangle no
(use-package browse-kill-ring
  :ensure nil
  :bind
  ;; ("C-c H-k" . browse-kill-ring)
  :load-path  (lambda ()
                (expand-file-name
                 (concat
                  my-user-emacs-directory
                  "contrib/")
                 )
                )
  ;; :load-path (concat my-user-emacs-directory "contrib/")
  :config
  (browse-kill-ring-default-keybindings); map M-y to browse-kill-ring
  )
#+end_src

* UI
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       181557E2-40BD-4061-A865-94312CFF85AE
:END:

** posframe

#+begin_src emacs-lisp
(use-package posframe
  :ensure nil
  :defer 1
  ;; posframe-poshandler-window-top-center
  )
#+end_src

