package.org
** header

#+begin_src emacs-lisp
;; sticky header: topsy
;; {{{
(use-package topsy
  :ensure nil
  :hook (prog-mode . topsy-mode) ;; (add-hook 'prog-mode-hook #'topsy-mode)
  )

;; https://github.com/alphapapa/org-sticky-header/issues/14
(use-package org-sticky-header
  :ensure nil
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full)
  )
;; }}}
#+end_src

** 版本控制

#+begin_src emacs-lisp
;; diff-hl
;; {{{
(use-package diff-hl
  :ensure nil
  :hook (
         (after-init . global-diff-hl-mode)
         (dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh)
         )
  :bind
  (
   :map diff-hl-mode-map
   ("<left-fringe> <mouse-1>" . diff-hl-diff-goto-hunk)
   )
  :config
  (unless (display-graphic-p)
    (diff-hl-margin-mode))
  )

;; (global-git-gutter-mode +1) ; BUG/Bad performance when deleting folded 17000+lines
;; }}}
#+end_src

** region: goggles

Emacs 29: copy-region-blink-predicate

#+begin_src emacs-lisp
;; goggles: visual hint for operations
;; {{{
(use-package goggles
  :ensure nil
  :hook ((prog-mode text-mode) . goggles-mode)
  :config
  (setq goggles-pulse-delay 0.35)
  (setq-default goggles-pulse t) ;; set to nil to disable pulsing
  )
;; }}}
#+end_src

** structure: highlight-sexps

[[https://david.rysdam.org/src/emacs/highlight-sexps.el][highlight-sexps.el]]

** 分隔符: rainbow-delimiters

#+begin_src emacs-lisp :tangle no
(use-package rainbow-delimiters
  :ensure nil
  :hook (prog-mode . rainbow-delimiters-mode)
  )
#+end_src

** 括号: highlight-parentheses

#+begin_src emacs-lisp
;; highlight-parentheses
;; {{{
(use-package highlight-parentheses
  :defer 1
  ;; :hook (after-init . highlight-parentheses-mode)
  :config
  (setq  highlight-parentheses-colors ; 括号颜色（由内向外）
         '(
           "green1"
           "blue1"
           "orange1"
           "purple1"
           "yellow1"
           "red1"
           ;; "pink" ; only six colors supported ?
           ))
  (global-highlight-parentheses-mode t)
  )

;; Apple Six Colors
;; (setq highlight-parentheses-colors
;; '(
;;   "#61BB46"
;;   "#FDB827"
;;   "#F5821F"
;;   "#E03A3E"
;;   "#963D97"
;;   "#009DDC"
;;   ))
;; }}}
#+end_src

** doom-modeline

#+begin_src emacs-lisp
;; doom-modeline
;; {{{
;; (add-hook 'after-init-hook #'doom-modeline-mode)
;; (setq doom-modeline-support-imenu t)
(use-package doom-modeline
  :ensure nil
  ;; :init (doom-modeline-mode 1)
  :hook (after-init . doom-modeline-mode)
  :custom
  ;; Don't compact font caches during GC. Windows Laggy Issue
  (inhibit-compacting-font-caches t)
  :config
  ;; Buffer File Project
  (setq doom-modeline-buffer-file-name-style 'relative-to-project)
  (setq doom-modeline-highlight-modified-buffer-name t)
  (setq doom-modeline-project-detection 'auto) ;auto/project
  ;; Mode
  (setq doom-modeline-major-mode-color-icon (display-graphic-p))
  (setq doom-modeline-minor-modes nil)
  ;; UI
  (setq doom-modeline-height 18)
  (setq doom-modeline-icon (display-graphic-p))
  (setq doom-modeline-window-width-limit 85)
  )
;; }}}
#+end_src

** 主题 theme

#+begin_src emacs-lisp :tangle no
(use-package timu-macos-theme
  :ensure nil
  :defer 3
  :custom
  (
   ;; (timu-macos-flavour "light")
   (timu-macos-mode-line-border t))
  :config (load-theme 'timu-macos t))
#+end_src

** ICON 图标

** all-the-icons

#+begin_src emacs-lisp
;; all-the-icons
;; {{{
(use-package all-the-icons
  :ensure nil
  ;; :when (display-graphic-p)
  :if (display-graphic-p)
  )

(use-package all-the-icons-completion
  :ensure nil
  :if (display-graphic-p)
  :hook
  (
   (after-init . all-the-icons-completion-mode)
   (marginalia-mode . all-the-icons-completion-marginalia-setup)
   )
  )

(use-package all-the-icons-dired
  :ensure nil
  :when (display-graphic-p)
  :hook
  (dired-mode . all-the-icons-dired-mode)
  )
;; }}}
#+end_src

** rainbow-delimiters

#+begin_src emacs-lisp :tangle no

#+end_src

** rainbow-blocks

#+begin_src emacs-lisp :tangle no

#+end_src

* 折叠
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       F9BC2CD6-E690-47C1-AED9-71A98B5C79A3
:END:

** ts-fold :Git:

#+begin_src emacs-lisp
;; ts-fold
;; {{{
;; (use-package ts-fold
;;   :ensure nil
;;   )
;; (add-hook 'tree-sitter-after-on-hook #'ts-fold-indicators-mode)
;; }}}
#+end_src

** ts-fold
** origami

#+begin_src emacs-lisp
;; fold: origami
;; {{{
(add-hook 'prog-mode-hook 'origami-mode)
(with-eval-after-load 'origami
  (define-key origami-mode-map (kbd "C-c f") 'origami-recursively-toggle-node)
  (define-key origami-mode-map (kbd "C-c F") 'origami-toggle-all-nodes)
  )
;; }}}
#+end_src

** hideshow-orgmode

https://github.com/logangrado/hideshow-orgmode

* frame 管理
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       79C8DC5B-DA42-4A27-8615-9A382380B698
:END:

** moom

#+begin_src emacs-lisp :tangle no
(with-suppressed-warnings '(void-function transient-prefix)) ;FIXME
(add-to-list 'warning-suppress-types '((void-function transient-prefix)))
  (with-eval-after-load "moom"
    (setq moom-use-font-module nil)
    ;; (moom-recommended-keybindings '(all wof))
    (moom-recommended-keybindings '(move fit expand fill font reset undo))
    (when (require 'moom-transient nil t)
      (moom-transient-hide-cursor) ;; if needed
      (define-key moom-mode-map (kbd "C-c o") #'moom-transient-dispatch)
      )
    )
#+end_src

#+begin_src emacs-lisp :tangle no
  (use-package moom
    :ensure nil
    :if (display-graphic-p)
    :after transient
    ;; :bind
    ;; (
    ;;  :map moom-mode-map
    ;;       ("H-o H-o" . moom-transient-dispatch)
    ;;       )
    :config
    (setq moom-use-font-module nil)
    (moom-mode 1)
    ;; (moom-transient-hide-cursor)
    (moom-recommended-keybindings '(move fit expand fill font reset undo))
    )
#+end_src

#+begin_src emacs-lisp :tangle no
;; moom + transient
;; {{{
(with-suppressed-warnings '(void-function transient-prefix)) ;FIXME
(add-to-list 'warning-suppress-types '((void-function transient-prefix)))
(use-package moom
  ;; :after transcient
  :ensure nil
  ;; :defer 1
  ;; :if (memq window-system '(mac ns x))
  ;; (keymap-global-set "" #'moom-font-increase)
  :commands (moom-transient-dispatch moom-transient-config)
  :config
  (require 'moom-transient)
  (setq moom-use-font-module nil)
  (moom-mode 1)
  (moom-transient-hide-cursor) ;; if needed
  ;; (define-key moom-mode-map (kbd "C-c o") #'moom-transient-dispatch)
  (moom-recommended-keybindings '(move fit expand fill font reset undo))
  )

;; (unless (and (display-graphic-p) (eq system-type 'darwin))
;;   (add-hook 'after-init-hook 'moom-mode)
;;   )
;; }}}
#+end_src

* window 管理
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       F78BB24E-0E25-4C5A-A754-23AD22847736
:END:

** zoom

** ace-window

#+begin_src emacs-lisp
;; {{{ ace-window
;; (require 'ace-window)
;; (keymap-global-set "H-w H-w" #'ace-window)
(use-package ace-window
  :ensure nil
  :bind
  ("H-w H-w" . ace-window)
  :config
  (setq aw-keys '(?e ?a ?s ?d ?f ?g ?h ?j ?k ?l ?v ?n))
  )
;; }}}
#+end_src

* Org family
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       CE9D175A-8FE9-4C90-A87C-62B3BB2C0748
:END:

** org-download

#+begin_src emacs-lisp :tangle no
(setq  org-download-screenshot-method "screencapture -i %s")
#+end_src

** org-modern

#+begin_src emacs-lisp
(use-package org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (if (display-graphic-p)
      (setq org-modern-table t)
    (setq org-modern-table nil)
    )
  )
#+end_src

** org-crypt

#+begin_src emacs-lisp :tangle no
(when (my-eval-if-binary-or-warn "gpg")
  (require 'org-crypt)
#+end_src

** org-import-calendar

** org-ref

** org-mind-map

[[https://github.com/the-ted/org-mind-map][the-ted/org-mind-map]]: This is an emacs package that creates graphviz directed graphs.

** org-auto-tangle :Git:

~~谁在自动导出时给文件开始位置添加了一个 feff 字符？~~

#+begin_src emacs-lisp
;; org-auto-tangle
;; {{{
(use-package org-auto-tangle
  :ensure nil
  :hook (org-mode . org-auto-tangle-mode)
  )
;; }}}
#+end_src

* org-roam
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       850BDBA1-B6FD-4149-8741-D9AC0F74F8BD
:END:

