site-lisp/my-package.el

;; [[file:../package.org::*header][header:1]]
;; sticky header: topsy
;; {{{
(use-package topsy
  :ensure nil
  :hook (prog-mode . topsy-mode) ;; (add-hook 'prog-mode-hook #'topsy-mode)
  )

;; https://github.com/alphapapa/org-sticky-header/issues/14
(use-package org-sticky-header
  :ensure nil
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full)
  )
;; }}}
;; header:1 ends here

;; [[file:../package.org::*版本控制][版本控制:1]]
;; diff-hl
;; {{{
(use-package diff-hl
  :ensure nil
  :hook (
         (after-init . global-diff-hl-mode)
         (dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh)
         )
  :bind
  (
   :map diff-hl-mode-map
   ("<left-fringe> <mouse-1>" . diff-hl-diff-goto-hunk)
   )
  :config
  (unless (display-graphic-p)
    (diff-hl-margin-mode))
  )

;; (global-git-gutter-mode +1) ; BUG/Bad performance when deleting folded 17000+lines
;; }}}
;; 版本控制:1 ends here

;; [[file:../package.org::*region: goggles][region: goggles:1]]
;; goggles: visual hint for operations
;; {{{
(use-package goggles
  :ensure nil
  :hook ((prog-mode text-mode) . goggles-mode)
  :config
  (setq goggles-pulse-delay 0.35)
  (setq-default goggles-pulse t) ;; set to nil to disable pulsing
  )
;; }}}
;; region: goggles:1 ends here

;; [[file:../package.org::*括号: highlight-parentheses][括号: highlight-parentheses:1]]
;; highlight-parentheses
;; {{{
(use-package highlight-parentheses
  :defer 1
  ;; :hook (after-init . highlight-parentheses-mode)
  :config
  (setq  highlight-parentheses-colors ; 括号颜色（由内向外）
         '(
           "green1"
           "blue1"
           "orange1"
           "purple1"
           "yellow1"
           "red1"
           ;; "pink" ; only six colors supported ?
           ))
  (global-highlight-parentheses-mode t)
  )

;; Apple Six Colors
;; (setq highlight-parentheses-colors
;; '(
;;   "#61BB46"
;;   "#FDB827"
;;   "#F5821F"
;;   "#E03A3E"
;;   "#963D97"
;;   "#009DDC"
;;   ))
;; }}}
;; 括号: highlight-parentheses:1 ends here

;; [[file:../package.org::*doom-modeline][doom-modeline:1]]
;; doom-modeline
;; {{{
;; (add-hook 'after-init-hook #'doom-modeline-mode)
;; (setq doom-modeline-support-imenu t)
(use-package doom-modeline
  :ensure nil
  ;; :init (doom-modeline-mode 1)
  :hook (after-init . doom-modeline-mode)
  :custom
  ;; Don't compact font caches during GC. Windows Laggy Issue
  (inhibit-compacting-font-caches t)
  :config
  ;; Buffer File Project
  (setq doom-modeline-buffer-file-name-style 'relative-to-project)
  (setq doom-modeline-highlight-modified-buffer-name t)
  (setq doom-modeline-project-detection 'auto) ;auto/project
  ;; Mode
  (setq doom-modeline-major-mode-color-icon (display-graphic-p))
  (setq doom-modeline-minor-modes nil)
  ;; UI
  (setq doom-modeline-height 18)
  (setq doom-modeline-icon (display-graphic-p))
  (setq doom-modeline-window-width-limit 85)
  )
;; }}}
;; doom-modeline:1 ends here

;; [[file:../package.org::*all-the-icons][all-the-icons:1]]
;; all-the-icons
;; {{{
(use-package all-the-icons
  :ensure nil
  ;; :when (display-graphic-p)
  :if (display-graphic-p)
  )

(use-package all-the-icons-completion
  :ensure nil
  :if (display-graphic-p)
  :hook
  (
   (after-init . all-the-icons-completion-mode)
   (marginalia-mode . all-the-icons-completion-marginalia-setup)
   )
  )

(use-package all-the-icons-dired
  :ensure nil
  :when (display-graphic-p)
  :hook
  (dired-mode . all-the-icons-dired-mode)
  )
;; }}}
;; all-the-icons:1 ends here

;; [[file:../package.org::*ts-fold][ts-fold:1]]
;; ts-fold
;; {{{
;; (use-package ts-fold
;;   :ensure nil
;;   )
;; (add-hook 'tree-sitter-after-on-hook #'ts-fold-indicators-mode)
;; }}}
;; ts-fold:1 ends here

;; [[file:../package.org::*origami][origami:1]]
;; fold: origami
;; {{{
(add-hook 'prog-mode-hook 'origami-mode)
(with-eval-after-load 'origami
  (define-key origami-mode-map (kbd "C-c f") 'origami-recursively-toggle-node)
  (define-key origami-mode-map (kbd "C-c F") 'origami-toggle-all-nodes)
  )
;; }}}
;; origami:1 ends here

;; [[file:../package.org::*ace-window][ace-window:1]]
;; {{{ ace-window
;; (require 'ace-window)
;; (keymap-global-set "H-w H-w" #'ace-window)
(use-package ace-window
  :ensure nil
  :bind
  ("H-w H-w" . ace-window)
  :config
  (setq aw-keys '(?e ?a ?s ?d ?f ?g ?h ?j ?k ?l ?v ?n))
  )
;; }}}
;; ace-window:1 ends here

;; [[file:../package.org::*org-modern][org-modern:1]]
(use-package org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (if (display-graphic-p)
      (setq org-modern-table t)
    (setq org-modern-table nil)
    )
  )
;; org-modern:1 ends here

;; [[file:../package.org::*org-auto-tangle][org-auto-tangle:1]]
;; org-auto-tangle
;; {{{
(use-package org-auto-tangle
  :ensure nil
  :hook (org-mode . org-auto-tangle-mode)
  )
;; }}}
;; org-auto-tangle:1 ends here
