package.org
* markdown
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       E004F903-F047-4309-8C54-3F11FB064EB6
:END:

#+begin_src emacs-lisp
;; markdown-mode
;; {{{
(use-package markdown-mode
  :ensure nil
  :defer t
  :commands
  (markdown-mode gfm-mode)
  :mode
  (
   ("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . gfm-mode)
   ("\\.markdown\\'" . markdown-mode)
   )
  :init
  (setq markdown-command "pandoc")
  :config
  (setq visual-line-column 90)
  (setq markdown-fontify-code-blocks-natively t)
  (setq markdown-enable-wiki-links t) ;; wikilink/backlink
  (setq markdown-wiki-link-search-type "project")
  (setq markdown-enable-math t)
  )
;; }}}
#+end_src

* ekg
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       6E4531B5-DF05-4BA9-BA7F-54CD0F016EBE
:END:

https://github.com/ahyatt/ekg

[[https://sspai.com/post/77394][Tana：2022 最惊艳的笔记软件 - 少数派]]

#+begin_src emacs-lisp

#+end_src

* 邮件/邮箱
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       D838ABFA-10F1-4E87-AA04-0592B1AC77BE
:END:

** notmuch

* 网页浏览、信息订阅
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       D46579B0-56E1-4F3F-88BF-DCED1B6A9AC9
:END:

** goggle-this

[[https://github.com/Malabarba/emacs-google-this][Malabarba/emacs-google-this: A set of emacs functions and bindings to google under point.]]

** 必应词典: bing-dict

#+begin_src emacs-lisp
(use-package
  bing-dict
  :ensure nil
  :bind ("C-c d b" . bing-dict-brief)
  :config (setq bing-dict-vocabulary-save t)
  (setq bing-dict-vocabulary-file
        (expand-file-name "assets/vocabulary.org" (concat user-emacs-directory)))
  (setq bing-dict-pronunciation-style 'us) ; us uk
  (setq bing-dict-show-thesaurus 'both) ; synonym and antonym

  (defun my/open-vocabulary-file () ;; Emacs init
    (interactive)
    (find-file-other-window bing-dict-vocabulary-file))
  )
#+end_src

** elfeed

#+begin_src emacs-lisp
;; elfeed
;; {{{
;; reference: https://github.com/jiacai2050/jiacai2050.github.io/blob/hugo/playground/mu4e-elfeed-config.el
(use-package elfeed
  :defer t
  :ensure nil
  ;; :bind
  ;; (
  ;;  :map elfeed-search-mode-map
  ;;  ("A" . bjm/elfeed-show-all)
  ;;  ("E" . bjm/elfeed-show-emacs)
  ;;  ("D" . bjm/elfeed-show-daily)
  ;;  ("q" . bjm/elfeed-save-db-and-bury)
  ;;  )
  :custom((elfeed-use-curl t)
          (elfeed-db-directory "~/Downloads/elfeed/")
          (elfeed-curl-timeout 20)
          )
  )

;; elfeed-dashboard
(use-package elfeed-dashboard
  :ensure nil
  :after elfeed
  )

;;elfeed-org
(use-package elfeed-org
  :ensure nil
  :defer t
  ;; :after elfeed
  ;; :hook (elfeed-dashboard-mode . elfeed-org)
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files
        (list (expand-file-name "assets/elfeed.org" user-emacs-directory)))
  )
;; }}}
#+end_src

** shrface                                                           :FIXME:

#+begin_src emacs-lisp
;; shrface eww nov
;; {{{
(use-package shrface
  :defer t
  :hook (eww-after-render-hook . shrface-mode)
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t)
  )
;; }}}
#+end_src

** 电子书 EPUB: nov

#+begin_src emacs-lisp :tangle no
(use-package nov
  :defer t
  :hook (nov-mode . shrface-mode)
  :mode ("\\.[eE][pP][uU][bB]\\'" . nov-mode)
  :config
  (
   ;; (setq nov-text-width 80)
   (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
   (add-to-list 'auto-mode-alist '("\\.epub$" . nov-mode))
   (require 'shrface)
   (setq nov-shr-rendering-functions '(
                                       (img . nov-render-img)
                                       (title . nov-render-title)))
   (setq nov-shr-rendering-functions
         (append nov-shr-rendering-functions
                 shr-external-rendering-functions))
   )
  )
#+end_src

** PDF

#+begin_src emacs-lisp :tangle no
;; ;; pdf-tools
;; ;; {{{
;; ;; https://github.com/furkanusta/dotfiles/blob/master/emacs/dot-emacs.d/elisp/usta-uncategorized.el
;; (use-package pdf-tools
;;   :ensure nil
;;   ;; :magic ("%PDF" . pdf-view-mode)
;;   :mode ("\\.[pP][dD][fF]\\'" . pdf-view-mode)
;;   ;; :hook (
;;     ;; (pdf-view-mode . disable-line-numbers)
;;          ;; (pdf-view-mode . pdf-sync-minor-mode)
;;          ;; (pdf-view-mode . pdf-links-minor-mode)
;;          ;; (pdf-view-mode . pdf-history-minor-mode)
;;          ;; (pdf-view-mode . pdf-annot-minor-mode)
;;          ;; (pdf-view-mode . pdf-view-themed-minor-mode)
;;     ;; )
;;   :custom
;;   (pdf-view-display-size 'fit-page)
;;   ;; (pdf-annot-activate-created-annotations nil)
;;   (pdf-view-resize-factor 1.1)
;;   :bind (:map pdf-view-mode-map
;;          ("M-w" . pdf-view-kill-ring-save)
;;               ("o" . pdf-outline)
;;               ("O" . pdf-occur)
;;               ("M-g M-g" . pdf-view-goto-page)
;;               ("S-SPC" . pdf-view-scroll-down-or-previous-page)
;;          ("<double-wheel-down>" .  pdf-view-next-line-or-next-page)
;;          ("<triple-wheel-down>" .  pdf-view-next-line-or-next-page)
;;          ("j" . pdf-view-next-line-or-next-page)
;;          ("k" . pdf-view-previous-line-or-previous-page)
;;          ("J" . forward-page)
;;          ("K" . backward-page)
;;          ("=" . pdf-view-enlarge)
;;          ("-" . pdf-view-shrink)
;;          ("w" . pdf-view-fit-width-to-window)
;;          ("h" . pdf-view-fit-height-to-window)
;;          ("p" . pdf-view-fit-page-to-window)
;;          ("/" . isearch-forward)
;;     )
;;   )

;; ;; (keymap-set pdf-view-mode "<double-wheel-down>"  #'pdf-view-next-line-or-next-page)
;; ;; (keymap-set pdf-view-mode "<triple-wheel-down>"  #'pdf-view-next-line-or-next-page)
;; ;; }}}
#+end_src

** 速读 speed-reading

https://github.com/zk-phi/spray

#+begin_src emacs-lisp :tangle no
(use-package spray
  :ensure nil
  :defer 110
  :config ;; executed after loading package
  :bind (:map my-map ("s" . spray-mode))
  )
#+end_src

* UI
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       547CC50E-FDE2-40D9-A752-8273F8D60E35
:END:

** nyan-mode

#+begin_src emacs-lisp
(use-package nyan-mode
  :ensure nil
  :defer 3
  :hook (parrot-mode . nyan-mode)
  :config
  (setq nyan-animate-nyancat t
        nyan-wavy-trail t)
  )
#+end_src

** auto-dark

主题跟随系统 UI

#+begin_src emacs-lisp
;; auto-dark
;; {{{
(use-package auto-dark
  :ensure nil
  :defer 3
  :if (display-graphic-p)
  ;; :init (auto-dark-mode t)
  ;; :hook (after-init . auto-dark-mode)
  :config
  (setq auto-dark-allow-osascript t
        auto-dark-dark-theme 'solarized-dark)
  )
;; }}}
#+end_src

** zoom-to-point :Git:
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       489B39A2-E28E-4DDC-9D81-469C8148BE88
:END:

#+begin_src emacs-lisp :tangle no
;; https://github.com/rmloveland/zoom-to-point

(defvar *default-zoom-level* 3
  "Defines how much the `zoom-toggle' command will increase the text scale.")

;; This variable is buffer-local, and isn't always initialized; this
;; causes an error.  We initialize it here to avoid causing errors.
;; So far it's worked well.
(setq text-scale-mode-amount 0)

(defun zoom-toggle ()
  "Zoom in or out on the line at point.
More precisely, increase or decrease the size of the text by the
amount defined in `*default-zoom-level*', and centers that line
in the window."
  (interactive)
  (if (zoom--zoomed-p)
      (zoom--unzoom)
    (zoom--zoom-to-point)))

(defun zoom--do (thunk)
  "Call THUNK, and then recenter point."
  (save-excursion
    (funcall thunk)
    (recenter)))

(defun zoom--zoom-to-point ()
  "Zoom in on point."
  (zoom--do (lambda ()
              (text-scale-increase *default-zoom-level*))))

(defun zoom--unzoom ()
  "Zoom out from point and return to the default text scale."
  (zoom--do (lambda ()
              (text-scale-set 0))))

(defun zoom--zoomed-p ()
  "Is the buffer text larger than the default?"
  (if (= text-scale-mode-amount 0)
      nil
    t))
#+end_src

* 图表图像 diagram & image
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       6B8BFE51-5F0D-44D2-A83D-7136B7174630
:END:

** Graphviz

#+begin_src emacs-lisp
;; graphviz-dot-mode
;; {{{
(use-package graphviz-dot-mode
  :ensure nil
  :defer t
  ;; :bind
  ;; ()
  :config
  (setq graphviz-dot-indent-width 4)
  (setq graphviz-dot-preview-extension "svg")
  )
;; }}}
#+end_src

** PlantUML

#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook (lambda ()
                           (require 'plantuml)))
(with-eval-after-load 'plantuml
  (setq plantuml-jar-path
        (concat
         (string-trim
          (shell-command-to-string "readlink -f $(brew --prefix plantuml)"))
         "/libexec/plantuml.jar")))
#+end_src

** D2 :Git:

#+begin_src emacs-lisp
(use-package d2-mode
  :ensure nil
  :defer t
  ;; :bind
  ;; (
  ;;  :map d2-mode-map
  ;;  )
  )
#+end_src

#+begin_src emacs-lisp :tangle no
;; D2 Mode
;; {{{
(add-to-list 'auto-mode-alist '("\\.d2" . d2-mode))
(defvar d2-mode-map
  (let ((map (make-sparse-keymap)))
    (keymap-set map "C-c C-c" #'d2-compile)
    (keymap-set map "C-c C-f" #'d2-compile-file)
    (keymap-set map "C-c C-b" #'d2-compile-buffer)
    (keymap-set map "C-c C-r" #'d2-compile-region)
    (keymap-set map "C-c C-h" #'d2-compile-file-and-browse)
    (keymap-set map "C-c C-j" #'d2-compile-buffer-and-browse)
    (keymap-set map "C-c C-k" #'d2-compile-region-and-browse)
    (keymap-set map "C-c C-o" #'d2-open-browser)
    (keymap-set map "C-x C-o" #'d2-view-current-svg)
    (keymap-set map "C-c C-d" #'d2-open-doc)
    map))
;; (org-babel-do-load-languages
;;     'org-babel-load-languages
;;     '(
;;       ;; (mermaid . t)
;;       (scheme . t)
;;       (d2 . t)))
;; }}}
#+end_src

** frameshot

** screenshot :Git:

Doesn't work on macOS: =(void-function x-export-frames)=

#+begin_src emacs-lisp :tangle no
(use-package d2-mode
  :ensure nil
  :defer t
  ;; :bind
  ;; (
  ;;  :map d2-mode-map
  ;;  )
  )
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package screenshot
  :ensure nil
  :defer t
  :screenshot
  (commands)
  :hook
  ((screenshot-buffer-creation-hook . my/screenshot-on-buffer-creation))
  :config
  (setq screenshot-line-numbers-p nil)
  (setq screenshot-min-width 80)
  (setq screenshot-max-width 80)
  (setq screenshot-truncate-lines-p nil)
  (setq screenshot-text-only-p nil)
  (setq screenshot-font-family "SF Mono")
  (setq screenshot-font-size 10)
  (setq screenshot-border-width 16)
  (setq screenshot-radius 0)
  (setq screenshot-shadow-radius 0)
  (setq screenshot-shadow-offset-horizontal 0)
  (setq screenshot-shadow-offset-vertical 0)

  (defun my/screenshot-on-buffer-creation ()
    (setq display-fill-column-indicator-column nil)
    (setq line-spacing nil))
  )
#+end_src

** image-roll :Git:

#+begin_src emacs-lisp
;; image-roll
;; {{{
(use-package image-roll
  :defer t
  :ensure nil
  )
;; }}}
#+end_src

