site-lisp/my-package.el
(use-package markdown-mode
  :ensure nil
  :defer t
  :commands
  (markdown-mode gfm-mode)
  :mode
  (
   ("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . gfm-mode)
   ("\\.markdown\\'" . markdown-mode)
   )
  :init
  (setq markdown-command "pandoc")
  :config
  (setq visual-line-column 90)
  (setq markdown-fontify-code-blocks-natively t)
  (setq markdown-enable-wiki-links t) ;; wikilink/backlink
  (setq markdown-wiki-link-search-type "project")
  (setq markdown-enable-math t)
  )
;; }}}
;; markdown:1 ends here

;; [[file:../package.org::*ekg][ekg:1]]

;; ekg:1 ends here

;; [[file:../package.org::*必应词典: bing-dict][必应词典: bing-dict:1]]
(use-package
  bing-dict
  :ensure nil
  :bind ("C-c d b" . bing-dict-brief)
  :config (setq bing-dict-vocabulary-save t)
  (setq bing-dict-vocabulary-file
        (expand-file-name "assets/vocabulary.org" (concat user-emacs-directory)))
  (setq bing-dict-pronunciation-style 'us) ; us uk
  (setq bing-dict-show-thesaurus 'both) ; synonym and antonym

  (defun my/open-vocabulary-file () ;; Emacs init
    (interactive)
    (find-file-other-window bing-dict-vocabulary-file))
  )
;; 必应词典: bing-dict:1 ends here

;; [[file:../package.org::*elfeed][elfeed:1]]
;; elfeed
;; {{{
;; reference: https://github.com/jiacai2050/jiacai2050.github.io/blob/hugo/playground/mu4e-elfeed-config.el
(use-package elfeed
  :defer t
  :ensure nil
  ;; :bind
  ;; (
  ;;  :map elfeed-search-mode-map
  ;;  ("A" . bjm/elfeed-show-all)
  ;;  ("E" . bjm/elfeed-show-emacs)
  ;;  ("D" . bjm/elfeed-show-daily)
  ;;  ("q" . bjm/elfeed-save-db-and-bury)
  ;;  )
  :custom((elfeed-use-curl t)
          (elfeed-db-directory "~/Downloads/elfeed/")
          (elfeed-curl-timeout 20)
          )
  )

;; elfeed-dashboard
(use-package elfeed-dashboard
  :ensure nil
  :after elfeed
  )

;;elfeed-org
(use-package elfeed-org
  :ensure nil
  :defer t
  ;; :after elfeed
  ;; :hook (elfeed-dashboard-mode . elfeed-org)
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files
        (list (expand-file-name "assets/elfeed.org" user-emacs-directory)))
  )
;; }}}
;; elfeed:1 ends here

;; [[file:../package.org::*shrface][shrface:1]]
;; shrface eww nov
;; {{{
(use-package shrface
  :defer t
  :hook (eww-after-render-hook . shrface-mode)
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t)
  )
;; }}}
;; shrface:1 ends here

;; [[file:../package.org::*nyan-mode][nyan-mode:1]]
(use-package nyan-mode
  :ensure nil
  :defer 3
  :hook (parrot-mode . nyan-mode)
  :config
  (setq nyan-animate-nyancat t
        nyan-wavy-trail t)
  )
;; nyan-mode:1 ends here

;; [[file:../package.org::*auto-dark][auto-dark:1]]
;; auto-dark
;; {{{
(use-package auto-dark
  :ensure nil
  :defer 3
  :if (display-graphic-p)
  ;; :init (auto-dark-mode t)
  ;; :hook (after-init . auto-dark-mode)
  :config
  (setq auto-dark-allow-osascript t
        auto-dark-dark-theme 'solarized-dark)
  )
;; }}}
;; auto-dark:1 ends here

;; [[file:../package.org::*Graphviz][Graphviz:1]]
;; graphviz-dot-mode
;; {{{
(use-package graphviz-dot-mode
  :ensure nil
  :defer t
  ;; :bind
  ;; ()
  :config
  (setq graphviz-dot-indent-width 4)
  (setq graphviz-dot-preview-extension "svg")
  )
;; }}}
;; Graphviz:1 ends here

;; [[file:../package.org::*D2][D2:1]]
(use-package d2-mode
  :ensure nil
  :defer t
  ;; :bind
  ;; (
  ;;  :map d2-mode-map
  ;;  )
  )
;; D2:1 ends here

;; [[file:../package.org::*image-roll][image-roll:1]]
;; image-roll
;; {{{
(use-package image-roll
  :defer t
  :ensure nil
  )
;; }}}
;; image-roll:1 ends here
