package.org
* 地图 map
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       5DD9E9A7-1FD6-4845-BEA4-D728C4123C14
:END:

#+begin_src emacs-lisp
;; osm: OpenStreetMap
;; {{{
(use-package osm
  :defer t
  ;; :after org
  :init
  ;; Load Org link support
  ;; (with-eval-after-load 'org
  ;;   (require 'osm-ol))
  :bind (
         ("C-c m h" . osm-home)
         ("C-c m s" . osm-search)
         ("C-c m v" . osm-server)
         ("C-c m t" . osm-goto)
         ("C-c m x" . osm-gpx-show)
         ("C-c m j" . osm-bookmark-jump)
         :map osm-mode-map
         ("q" . (lambda () (interactive) (quit-window t)))
         )
  :custom
  ;; Take a look at the customization group `osm' for more options.
  (osm-server 'default) ;; Configure the tile server
  (osm-copyright t)     ;; Display the copyright information
  )
;; }}}
#+end_src

* 影音 video & audio
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       0257E57A-47B9-4187-A56A-197C48FED858
:END:

** empv: 视频播放控制

#+begin_src emacs-lisp
(use-package empv
  :ensure nil
  :demand t
  :defer t
  )
#+end_src
** 音乐播放器: netease-cloud-music :Git:

#+begin_src emacs－lisp :tangle no
(require 'netease-cloud-music)
(require 'netease-cloud-music-ui) ; TUI
(require 'netease-cloud-music-comment)
#+end_src

* STT
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       1A8B6CE5-87EC-48FF-90E9-764B88FA504E
:END:

* 字幕※歌词 Subtitle & Lyric
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       1A1F64A5-F496-4649-B7FD-E298E538D2AC
:END:

** subed :Git:

#+begin_src emacs-lisp
;; subed: subtitle edit
;; {{{
(use-package subed
  :defer t
  :ensure nil
  :config
  ;; Disable automatic movement of point by default
  (add-hook 'subed-mode-hook 'subed-disable-sync-point-to-player)
  ;; Remember cursor position between sessions
  (add-hook 'subed-mode-hook 'save-place-local-mode)
  ;; Break lines automatically while typing
  (add-hook 'subed-mode-hook 'turn-on-auto-fill)
  ;; Break lines at 40 characters
  (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 40))))
;; }}}
#+end_src

* 阅读
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       E7520EEE-CDE8-40EC-BF29-7AD58DB7FB8B
:END:
** mybigword

#+begin_src emacs-lisp
;; mybigword
;; {{{
(use-package mybigword
  :defer t
  :config
  (setq mybigword-excluded-words
        (split-string (with-temp-buffer
                        (insert-file-contents  (expand-file-name
                                                "assets/mybigword.txt"
                                                (concat user-emacs-directory)
                                                ))
                        (buffer-string)) "[\r\n]+"))
  )
;; mybigword-excluded-words
;; mybigword-personal-excluded-words
;; mybigword-upper-limit
;; }}}
#+end_src

** olivetti

#+begin_src emacs-lisp
(use-package
  olivetti
  :hook
  (
   (after-init . olivetti-mode)
   ;; (window-configuration-change . my/toggle-olivetti-for-org)
   )
  :bind ("H-v H-v" . olivetti-mode)
  :init
  (setq olivetti-body-width 90) ; default: fill-column+2

  ;; https://emacs-china.org/t/emacs/19797/4
  (defun my/toggle-olivetti-for-org ()
    "if current buffer is org and only one visible buffer
  enable olivetti mode"
    (interactive)
    (if (and (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
             (or (eq (length (window-list nil nil nil)) 1)
                 (window-at-side-p (frame-first-window) 'right))) ;; frame-first-window 的 mode 是 org-mode 并且没有右边 window
        (olivetti-mode 1)
      (olivetti-mode 0)
      (when (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
        (visual-line-mode 1)))))
#+end_src

** dictionary-overlay :Git:

** nov-xwidget :Git:

#+begin_src emacs-lisp
(use-package nov-xwidget
  :ensure nil
  :demand t
  :after nov
  :config
  (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))
#+end_src

* TTS
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       BE3C7815-E778-4DBA-8139-500EF6C0B379
:END:

* 待整理
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle no
:ID:       51F8CE43-0A62-426B-91B0-1014D0D3E151
:END:

** crux

[[https://github.com/bbatsov/crux][bbatsov/crux: A Collection of Ridiculously Useful eXtensions for Emacs]]

** with-editor                                                       :FIXME:

#+begin_center
crontab: editor or filename too long
crontab: "/Applications/Emacs.app/Contents/MacOS/bin/emacsclient --socket-name=/var/folders/zs/ppvpcc991fx4bfvz1gy420wc0000gn/T/emacs501/server" exited with status 1
#+end_center

#+begin_src emacs-lisp
(use-package with-editor
  :ensure nil
  :defer t
  :init
  (defun my/edit-crontab ()
    (interactive)
    (let ((buf (get-buffer-create "*crontab*")))
      (with-editor-async-shell-command "crontab -e"
                                       buf buf)))
  (setq display-buffer-alist
        '(("\\*crontab\\*" .  (display-buffer-no-window . nil))))
  )
#+end_src

** ekg: super tag

[[https://github.com/ahyatt/ekg][ahyatt/ekg: The emacs knowledge graph, app for notes and structured data.]]

substitute of org-roam/denote

* File End
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle (concat user-emacs-directory "/site-lisp/my-package.el")
:ID:       667207FE-A62F-483D-B7D0-5673EB7911DF
:END:

#+begin_src emacs-lisp
;; 2023-02-09T02:34:54+0800

(provide 'my-package)

;;; my-package.el ends here.
#+end_src

* Misc
:PROPERTIES:
:header-args: emacs-lisp :comments link :tangle no
:ID:       FF39F596-5CDD-4779-9157-A14EE63CC0AD
:END:
