site-lisp/my-package.el

;; [[file:../package.org::*地图 map][地图 map:1]]
;; osm: OpenStreetMap
;; {{{
(use-package osm
  :defer t
  ;; :after org
  :init
  ;; Load Org link support
  ;; (with-eval-after-load 'org
  ;;   (require 'osm-ol))
  :bind (
         ("C-c m h" . osm-home)
         ("C-c m s" . osm-search)
         ("C-c m v" . osm-server)
         ("C-c m t" . osm-goto)
         ("C-c m x" . osm-gpx-show)
         ("C-c m j" . osm-bookmark-jump)
         :map osm-mode-map
         ("q" . (lambda () (interactive) (quit-window t)))
         )
  :custom
  ;; Take a look at the customization group `osm' for more options.
  (osm-server 'default) ;; Configure the tile server
  (osm-copyright t)     ;; Display the copyright information
  )
;; }}}
;; 地图 map:1 ends here

;; [[file:../package.org::*empv: 视频播放控制][empv: 视频播放控制:1]]
(use-package empv
  :ensure nil
  :demand t
  :defer t
  )
;; empv: 视频播放控制:1 ends here

;; [[file:../package.org::*subed][subed:1]]
;; subed: subtitle edit
;; {{{
(use-package subed
  :defer t
  :ensure nil
  :config
  ;; Disable automatic movement of point by default
  (add-hook 'subed-mode-hook 'subed-disable-sync-point-to-player)
  ;; Remember cursor position between sessions
  (add-hook 'subed-mode-hook 'save-place-local-mode)
  ;; Break lines automatically while typing
  (add-hook 'subed-mode-hook 'turn-on-auto-fill)
  ;; Break lines at 40 characters
  (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 40))))
;; }}}
;; subed:1 ends here

;; [[file:../package.org::*mybigword][mybigword:1]]
;; mybigword
;; {{{
(use-package mybigword
  :defer t
  :config
  (setq mybigword-excluded-words
        (split-string (with-temp-buffer
                        (insert-file-contents  (expand-file-name
                                                "assets/mybigword.txt"
                                                (concat user-emacs-directory)
                                                ))
                        (buffer-string)) "[\r\n]+"))
  )
;; mybigword-excluded-words
;; mybigword-personal-excluded-words
;; mybigword-upper-limit
;; }}}
;; mybigword:1 ends here

;; [[file:../package.org::*olivetti][olivetti:1]]
(use-package
  olivetti
  :hook
  (
   (after-init . olivetti-mode)
   ;; (window-configuration-change . my/toggle-olivetti-for-org)
   )
  :bind ("H-v H-v" . olivetti-mode)
  :init
  (setq olivetti-body-width 90) ; default: fill-column+2

  ;; https://emacs-china.org/t/emacs/19797/4
  (defun my/toggle-olivetti-for-org ()
    "if current buffer is org and only one visible buffer
  enable olivetti mode"
    (interactive)
    (if (and (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
             (or (eq (length (window-list nil nil nil)) 1)
                 (window-at-side-p (frame-first-window) 'right))) ;; frame-first-window 的 mode 是 org-mode 并且没有右边 window
        (olivetti-mode 1)
      (olivetti-mode 0)
      (when (eq (buffer-local-value 'major-mode (current-buffer)) 'org-mode)
        (visual-line-mode 1)))))
;; olivetti:1 ends here

;; [[file:../package.org::*nov-xwidget][nov-xwidget:1]]
(use-package nov-xwidget
  :ensure nil
  :demand t
  :after nov
  :config
  (define-key nov-mode-map (kbd "o") 'nov-xwidget-view)
  (add-hook 'nov-mode-hook 'nov-xwidget-inject-all-files))
;; nov-xwidget:1 ends here

;; [[file:../package.org::*File End][File End:1]]
;; 2023-02-09T02:34:54+0800

(provide 'my-package)

;;; my-package.el ends here.
;; File End:1 ends here
